#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 95666297e0dffb00927d4fd9c305bf8e.pdb
; shader hash: 95666297e0dffb00927d4fd9c305bf8e
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !43)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_003.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 122, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 122, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !24, !38, !41, !42}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 9, type: !18, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 3, size: 256, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 5, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !1, line: 6, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@I@Z", scope: !25, file: !25, line: 175, type: !26, isLocal: false, isDefinition: true, scopeLine: 176, flags: DIFlagPrototyped, isOptimized: false)
!25 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_Common.hlsli", directory: "")
!26 = !DISubroutineType(types: !27)
!27 = !{!28, !28, !36}
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 11, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 11, size: 96, align: 32, elements: !30, templateParams: !34)
!30 = !{!31, !32, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 11, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 11, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 11, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!13, !35}
!35 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 124, baseType: !37)
!37 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!38 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !25, file: !25, line: 148, type: !39, isLocal: false, isDefinition: true, scopeLine: 149, flags: DIFlagPrototyped, isOptimized: false)
!39 = !DISubroutineType(types: !40)
!40 = !{!28, !28}
!41 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !25, file: !25, line: 153, type: !39, isLocal: false, isDefinition: true, scopeLine: 154, flags: DIFlagPrototyped, isOptimized: false)
!42 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !25, file: !25, line: 164, type: !39, isLocal: false, isDefinition: true, scopeLine: 165, flags: DIFlagPrototyped, isOptimized: false)
!43 = !{!44, !68, !69, !71, !73, !75, !76, !77, !86, !90, !92, !93, !94, !95}
!44 = !DIGlobalVariable(name: "view", linkageName: "\01?view@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !25, line: 121, type: !45, isLocal: false, isDefinition: true)
!45 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !46)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 121, baseType: !47)
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 121, size: 512, align: 32, elements: !48, templateParams: !65)
!48 = !{!49, !50, !51, !52, !53, !54, !55, !56, !57, !58, !59, !60, !61, !62, !63, !64}
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !47, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!65 = !{!13, !66, !67}
!66 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!67 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!68 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !25, line: 121, type: !45, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "scene_light_ambient", linkageName: "\01?scene_light_ambient@SceneConstantBufferInstance@@3V?$vector@M$03@@B", scope: !0, file: !25, line: 122, type: !70, isLocal: false, isDefinition: true)
!70 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!71 = !DIGlobalVariable(name: "scene_standard_nits", linkageName: "\01?scene_standard_nits@SceneConstantBufferInstance@@3MB", scope: !0, file: !25, line: 123, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!73 = !DIGlobalVariable(name: "hdr_scanout_transform", linkageName: "\01?hdr_scanout_transform@SceneConstantBufferInstance@@3IB", scope: !0, file: !25, line: 124, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !36)
!75 = !DIGlobalVariable(name: "scene_num_lights", linkageName: "\01?scene_num_lights@SceneConstantBufferInstance@@3IB", scope: !0, file: !25, line: 125, type: !74, isLocal: false, isDefinition: true)
!76 = !DIGlobalVariable(name: "perceptual_exponent", linkageName: "\01?perceptual_exponent@SceneConstantBufferInstance@@3MB", scope: !0, file: !25, line: 126, type: !72, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "scene_lights", linkageName: "\01?scene_lights@SceneConstantBufferInstance@@3QBULight_Data@@B", scope: !0, file: !25, line: 127, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_array_type, baseType: !79, size: 2048, align: 32, elements: !84)
!79 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !80)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !25, line: 112, size: 256, align: 32, elements: !81)
!81 = !{!82, !83}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !80, file: !25, line: 114, baseType: !4, size: 128, align: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !80, file: !25, line: 115, baseType: !4, size: 128, align: 32, offset: 128)
!84 = !{!85}
!85 = !DISubrange(count: 8)
!86 = !DIGlobalVariable(name: "instance_model_transform", linkageName: "\01?instance_model_transform@ModelConstantBufferInstance@@3QBV?$matrix@M$03$03@@B", scope: !0, file: !25, line: 133, type: !87, isLocal: false, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 13824, align: 32, elements: !88)
!88 = !{!89}
!89 = !DISubrange(count: 27)
!90 = !DIGlobalVariable(name: "instance_model_colour", linkageName: "\01?instance_model_colour@ModelConstantBufferInstance@@3QBV?$vector@M$03@@B", scope: !0, file: !25, line: 134, type: !91, isLocal: false, isDefinition: true)
!91 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 3456, align: 32, elements: !88)
!92 = !DIGlobalVariable(name: "model_transform", linkageName: "\01?model_transform@ModelConstantBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !25, line: 139, type: !45, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "model_colour", linkageName: "\01?model_colour@ModelConstantBuffer@@3V?$vector@M$03@@B", scope: !0, file: !25, line: 140, type: !70, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "st2084max", scope: !24, file: !25, line: 186, type: !72, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !41, file: !25, line: 155, type: !96, isLocal: false, isDefinition: true)
!96 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !97)
!97 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 155, baseType: !98)
!98 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 155, size: 288, align: 32, elements: !99, templateParams: !109)
!99 = !{!100, !101, !102, !103, !104, !105, !106, !107, !108}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !98, file: !1, line: 155, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!109 = !{!13, !110, !111}
!110 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!111 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!112 = !{i32 2, !"Dwarf Version", i32 4}
!113 = !{i32 2, !"Debug Info Version", i32 3}
!114 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!115 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Ctests\5CTgS KERNEL\5CUnitTest_003.ps.hlsl", !"#include \22UnitTest_Common.hlsli\22\0A\0Astruct PSInput\0A{\0A    float4 position     : SV_POSITION;\0A    float4 colour       : COLOR;\0A};\0A\0Afloat4 main(PSInput input) : SV_TARGET\0A{\0A    float3 gradient_colour_709 = pow(abs(input.colour.rgb), perceptual_exponent);\0A    float3 colour = HDRCorrection( gradient_colour_709, DISPLAY_CURVE_ST2084 );\0A    return float4( colour.rgb, 1.0f );\0A}"}
