#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyz 
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyzw        1     NONE   float   xyzw
;
; shader debug name: 76090b0d0c6d8b456ef51361c5e5c2db.pdb
; shader hash: 76090b0d0c6d8b456ef51361c5e5c2db
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 2
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 2
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !28)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_001.vs.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 15, type: !5, isLocal: false, isDefinition: true, scopeLine: 16, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !23}
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 9, size: 256, align: 32, elements: !8)
!8 = !{!9, !22}
!9 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !7, file: !1, line: 11, baseType: !10, size: 128, align: 32)
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 122, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 122, size: 128, align: 32, elements: !12, templateParams: !18)
!12 = !{!13, !15, !16, !17}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 122, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 122, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !11, file: !1, line: 122, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !11, file: !1, line: 122, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!18 = !{!19, !20}
!19 = !DITemplateTypeParameter(name: "element", type: !14)
!20 = !DITemplateValueParameter(name: "element_count", type: !21, value: i32 4)
!21 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !7, file: !1, line: 12, baseType: !10, size: 128, align: 32, offset: 128)
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_Vertex_Geom_01", file: !24, line: 52, size: 256, align: 32, elements: !25)
!24 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Vertex].h", directory: "")
!25 = !{!26, !27}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "m_vS0", scope: !23, file: !24, line: 53, baseType: !10, size: 128, align: 32)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "m_vCL", scope: !23, file: !24, line: 54, baseType: !10, size: 128, align: 32, offset: 128)
!28 = !{!29, !54, !55, !57, !59, !63, !64, !65, !74, !78, !80, !81}
!29 = !DIGlobalVariable(name: "view", linkageName: "\01?view@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !30, line: 121, type: !31, isLocal: false, isDefinition: true)
!30 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_Common.hlsli", directory: "")
!31 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !32)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 121, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 121, size: 512, align: 32, elements: !34, templateParams: !51)
!34 = !{!35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46, !47, !48, !49, !50}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !33, file: !1, line: 121, baseType: !14, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!51 = !{!19, !52, !53}
!52 = !DITemplateValueParameter(name: "row_count", type: !21, value: i32 4)
!53 = !DITemplateValueParameter(name: "col_count", type: !21, value: i32 4)
!54 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !30, line: 121, type: !31, isLocal: false, isDefinition: true)
!55 = !DIGlobalVariable(name: "scene_light_ambient", linkageName: "\01?scene_light_ambient@SceneConstantBufferInstance@@3V?$vector@M$03@@B", scope: !0, file: !30, line: 122, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!57 = !DIGlobalVariable(name: "scene_standard_nits", linkageName: "\01?scene_standard_nits@SceneConstantBufferInstance@@3MB", scope: !0, file: !30, line: 123, type: !58, isLocal: false, isDefinition: true)
!58 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !14)
!59 = !DIGlobalVariable(name: "hdr_scanout_transform", linkageName: "\01?hdr_scanout_transform@SceneConstantBufferInstance@@3IB", scope: !0, file: !30, line: 124, type: !60, isLocal: false, isDefinition: true)
!60 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !61)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 124, baseType: !62)
!62 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!63 = !DIGlobalVariable(name: "scene_num_lights", linkageName: "\01?scene_num_lights@SceneConstantBufferInstance@@3IB", scope: !0, file: !30, line: 125, type: !60, isLocal: false, isDefinition: true)
!64 = !DIGlobalVariable(name: "perceptual_exponent", linkageName: "\01?perceptual_exponent@SceneConstantBufferInstance@@3MB", scope: !0, file: !30, line: 126, type: !58, isLocal: false, isDefinition: true)
!65 = !DIGlobalVariable(name: "scene_lights", linkageName: "\01?scene_lights@SceneConstantBufferInstance@@3QBULight_Data@@B", scope: !0, file: !30, line: 127, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 2048, align: 32, elements: !72)
!67 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !68)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !30, line: 112, size: 256, align: 32, elements: !69)
!69 = !{!70, !71}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !68, file: !30, line: 114, baseType: !10, size: 128, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !68, file: !30, line: 115, baseType: !10, size: 128, align: 32, offset: 128)
!72 = !{!73}
!73 = !DISubrange(count: 8)
!74 = !DIGlobalVariable(name: "instance_model_transform", linkageName: "\01?instance_model_transform@ModelConstantBufferInstance@@3QBV?$matrix@M$03$03@@B", scope: !0, file: !30, line: 133, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 13824, align: 32, elements: !76)
!76 = !{!77}
!77 = !DISubrange(count: 27)
!78 = !DIGlobalVariable(name: "instance_model_colour", linkageName: "\01?instance_model_colour@ModelConstantBufferInstance@@3QBV?$vector@M$03@@B", scope: !0, file: !30, line: 134, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 3456, align: 32, elements: !76)
!80 = !DIGlobalVariable(name: "model_transform", linkageName: "\01?model_transform@ModelConstantBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !30, line: 139, type: !31, isLocal: false, isDefinition: true)
!81 = !DIGlobalVariable(name: "model_colour", linkageName: "\01?model_colour@ModelConstantBuffer@@3V?$vector@M$03@@B", scope: !0, file: !30, line: 140, type: !56, isLocal: false, isDefinition: true)
!82 = !{i32 2, !"Dwarf Version", i32 4}
!83 = !{i32 2, !"Debug Info Version", i32 3}
!84 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!85 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Ctests\5CTgS KERNEL\5CUnitTest_001.vs.hlsl", !"#include \22UnitTest_Common.hlsli\22\0A\0Astruct VSInput\0A{\0A    float4 position     : POSITION;\0A    float4 colour       : COLOR;\0A};\0A\0Astruct PSInput\0A{\0A    float4 position     : SV_POSITION;\0A    float4 colour       : COLOR;\0A};\0A\0APSInput main( in STg2_KN_GPU_Vertex_Geom_01 input )\0A{\0A    PSInput result;\0A\0A    result.position.xyz = input.m_vS0.xyz;\0A    result.position.w = 1.0F;\0A    result.colour = input.m_vCL;\0A\0A    return result;\0A}\0A"}
