#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; COLOR                    0   xyzw        1     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 3169c1e773c5b3c992adfd384830cb2b.pdb
; shader hash: 3169c1e773c5b3c992adfd384830cb2b
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !24)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_001.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 122, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 122, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, line: 122, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 9, type: !18, isLocal: false, isDefinition: true, scopeLine: 10, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput", file: !1, line: 3, size: 256, align: 32, elements: !21)
!21 = !{!22, !23}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !20, file: !1, line: 5, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !1, line: 6, baseType: !4, size: 128, align: 32, offset: 128)
!24 = !{!25, !50, !51, !53, !55, !59, !60, !61, !70, !74, !76, !77}
!25 = !DIGlobalVariable(name: "view", linkageName: "\01?view@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !26, line: 121, type: !27, isLocal: false, isDefinition: true)
!26 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/tests/TgS KERNEL/UnitTest_Common.hlsli", directory: "")
!27 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 121, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 121, size: 512, align: 32, elements: !30, templateParams: !47)
!30 = !{!31, !32, !33, !34, !35, !36, !37, !38, !39, !40, !41, !42, !43, !44, !45, !46}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !29, file: !1, line: 121, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!47 = !{!13, !48, !49}
!48 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!49 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!50 = !DIGlobalVariable(name: "projection", linkageName: "\01?projection@SceneConstantBufferInstance@@3V?$matrix@M$03$03@@B", scope: !0, file: !26, line: 121, type: !27, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariable(name: "scene_light_ambient", linkageName: "\01?scene_light_ambient@SceneConstantBufferInstance@@3V?$vector@M$03@@B", scope: !0, file: !26, line: 122, type: !52, isLocal: false, isDefinition: true)
!52 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !4)
!53 = !DIGlobalVariable(name: "scene_standard_nits", linkageName: "\01?scene_standard_nits@SceneConstantBufferInstance@@3MB", scope: !0, file: !26, line: 123, type: !54, isLocal: false, isDefinition: true)
!54 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!55 = !DIGlobalVariable(name: "hdr_scanout_transform", linkageName: "\01?hdr_scanout_transform@SceneConstantBufferInstance@@3IB", scope: !0, file: !26, line: 124, type: !56, isLocal: false, isDefinition: true)
!56 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 124, baseType: !58)
!58 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!59 = !DIGlobalVariable(name: "scene_num_lights", linkageName: "\01?scene_num_lights@SceneConstantBufferInstance@@3IB", scope: !0, file: !26, line: 125, type: !56, isLocal: false, isDefinition: true)
!60 = !DIGlobalVariable(name: "perceptual_exponent", linkageName: "\01?perceptual_exponent@SceneConstantBufferInstance@@3MB", scope: !0, file: !26, line: 126, type: !54, isLocal: false, isDefinition: true)
!61 = !DIGlobalVariable(name: "scene_lights", linkageName: "\01?scene_lights@SceneConstantBufferInstance@@3QBULight_Data@@B", scope: !0, file: !26, line: 127, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 2048, align: 32, elements: !68)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !26, line: 112, size: 256, align: 32, elements: !65)
!65 = !{!66, !67}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !64, file: !26, line: 114, baseType: !4, size: 128, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !64, file: !26, line: 115, baseType: !4, size: 128, align: 32, offset: 128)
!68 = !{!69}
!69 = !DISubrange(count: 8)
!70 = !DIGlobalVariable(name: "instance_model_transform", linkageName: "\01?instance_model_transform@ModelConstantBufferInstance@@3QBV?$matrix@M$03$03@@B", scope: !0, file: !26, line: 133, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 13824, align: 32, elements: !72)
!72 = !{!73}
!73 = !DISubrange(count: 27)
!74 = !DIGlobalVariable(name: "instance_model_colour", linkageName: "\01?instance_model_colour@ModelConstantBufferInstance@@3QBV?$vector@M$03@@B", scope: !0, file: !26, line: 134, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 3456, align: 32, elements: !72)
!76 = !DIGlobalVariable(name: "model_transform", linkageName: "\01?model_transform@ModelConstantBuffer@@3V?$matrix@M$03$03@@B", scope: !0, file: !26, line: 139, type: !27, isLocal: false, isDefinition: true)
!77 = !DIGlobalVariable(name: "model_colour", linkageName: "\01?model_colour@ModelConstantBuffer@@3V?$vector@M$03@@B", scope: !0, file: !26, line: 140, type: !52, isLocal: false, isDefinition: true)
!78 = !{i32 2, !"Dwarf Version", i32 4}
!79 = !{i32 2, !"Debug Info Version", i32 3}
!80 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!81 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Ctests\5CTgS KERNEL\5CUnitTest_001.ps.hlsl", !"#include \22UnitTest_Common.hlsli\22\0A\0Astruct PSInput\0A{\0A    float4 position     : SV_POSITION;\0A    float4 colour       : COLOR;\0A};\0A\0Afloat4 main(PSInput input) : SV_TARGET\0A{\0A    // This draws a perceptual gradient rather than a linear gradient.\0A    return float4(pow(abs(input.colour.rgb), perceptual_exponent), 1.0F);\0A}"}
