#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; POSITION                 1   xyz         2     NONE   float   xyz 
;
; shader debug name: 2342ee81a17b5c546bd38410f7ace4fc.pdb
; shader hash: 2342ee81a17b5c546bd38410f7ace4fc
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 1
; SigOutputElements: 3
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 1
; SigOutputVectors[0]: 3
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !38)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Geom_00_PS_P.vs.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !34}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_P", file: !21, line: 118, size: 320, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 120, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 121, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 122, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_Vertex_Geom_00", file: !35, line: 46, size: 128, align: 32, elements: !36)
!35 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Vertex].h", directory: "")
!36 = !{!37}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "m_vS0", scope: !34, file: !35, line: 47, baseType: !4, size: 128, align: 32)
!38 = !{!39, !46, !49, !54, !56, !109, !123, !147, !157, !166}
!39 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !40, isLocal: false, isDefinition: true)
!40 = !DICompositeType(tag: DW_TAG_array_type, baseType: !41, size: 512, align: 32, elements: !44)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !42)
!42 = !{!43}
!43 = !DITemplateTypeParameter(name: "element", type: !5)
!44 = !{!45}
!45 = !DISubrange(count: 4)
!46 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !47, isLocal: false, isDefinition: true)
!47 = !DICompositeType(tag: DW_TAG_array_type, baseType: !48, size: 640, align: 32, elements: !44)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !42)
!49 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !50, isLocal: false, isDefinition: true)
!50 = !DICompositeType(tag: DW_TAG_array_type, baseType: !51, size: 5120, align: 32, elements: !52)
!51 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !42)
!52 = !{!53}
!53 = !DISubrange(count: 32)
!54 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !55, isLocal: false, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!56 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !58)
!58 = !{!59}
!59 = !DITemplateTypeParameter(name: "T", type: !60)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !61, line: 71, size: 42624, align: 32, elements: !62)
!61 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!62 = !{!63, !76, !99, !100, !101, !102, !103, !107}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !60, file: !61, line: 73, baseType: !64, size: 256, align: 32)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !61, line: 21, size: 256, align: 32, elements: !65)
!65 = !{!66, !67, !68, !69, !72, !73, !74, !75}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !64, file: !61, line: 23, baseType: !8, size: 32, align: 32)
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !64, file: !61, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !64, file: !61, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !64, file: !61, line: 26, baseType: !70, size: 32, align: 32, offset: 96)
!70 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !71)
!71 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !64, file: !61, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !64, file: !61, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !64, file: !61, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !64, file: !61, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !60, file: !61, line: 74, baseType: !77, size: 512, align: 32, offset: 256)
!77 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !78)
!78 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !79, templateParams: !96)
!79 = !{!80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !78, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!96 = !{!13, !97, !98}
!97 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!98 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !60, file: !61, line: 74, baseType: !77, size: 512, align: 32, offset: 768)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !60, file: !61, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !60, file: !61, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !60, file: !61, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !60, file: !61, line: 78, baseType: !104, size: 32768, align: 32, offset: 1664)
!104 = !DICompositeType(tag: DW_TAG_array_type, baseType: !77, size: 32768, align: 32, elements: !105)
!105 = !{!106}
!106 = !DISubrange(count: 64)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !60, file: !61, line: 79, baseType: !108, size: 8192, align: 32, offset: 34432)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !105)
!109 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !110, isLocal: false, isDefinition: true)
!110 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !111)
!111 = !{!112}
!112 = !DITemplateTypeParameter(name: "T", type: !113)
!113 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !61, line: 60, size: 2304, align: 32, elements: !114)
!114 = !{!115, !116, !117, !118, !119, !120, !121, !122}
!115 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !113, file: !61, line: 62, baseType: !64, size: 256, align: 32)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !113, file: !61, line: 63, baseType: !77, size: 512, align: 32, offset: 256)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !113, file: !61, line: 63, baseType: !77, size: 512, align: 32, offset: 768)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !113, file: !61, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !113, file: !61, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !113, file: !61, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !113, file: !61, line: 67, baseType: !77, size: 512, align: 32, offset: 1664)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !113, file: !61, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!123 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !124, isLocal: false, isDefinition: true)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !125)
!125 = !{!126}
!126 = !DITemplateTypeParameter(name: "T", type: !127)
!127 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !61, line: 48, size: 17152, align: 32, elements: !128)
!128 = !{!129, !130, !131, !132, !140, !141, !142, !143}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !127, file: !61, line: 50, baseType: !64, size: 256, align: 32)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !127, file: !61, line: 51, baseType: !70, size: 32, align: 32, offset: 256)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !127, file: !61, line: 52, baseType: !70, size: 32, align: 32, offset: 288)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !127, file: !61, line: 53, baseType: !133, size: 64, align: 32, offset: 320)
!133 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !134)
!134 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !135, templateParams: !138)
!135 = !{!136, !137}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !134, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !134, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!138 = !{!13, !139}
!139 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !127, file: !61, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !127, file: !61, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !127, file: !61, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !127, file: !61, line: 57, baseType: !144, size: 16384, align: 32, offset: 768)
!144 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !145)
!145 = !{!146}
!146 = !DISubrange(count: 128)
!147 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !148, isLocal: false, isDefinition: true)
!148 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !149)
!149 = !{!150}
!150 = !DITemplateTypeParameter(name: "T", type: !151)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !61, line: 40, size: 544, align: 32, elements: !152)
!152 = !{!153, !154, !155, !156}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !151, file: !61, line: 42, baseType: !64, size: 256, align: 32)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !151, file: !61, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !151, file: !61, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !151, file: !61, line: 45, baseType: !70, size: 32, align: 32, offset: 512)
!157 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !158, isLocal: false, isDefinition: true)
!158 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !159)
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "T", type: !161)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !61, line: 34, size: 1280, align: 32, elements: !162)
!162 = !{!163, !164, !165}
!163 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !161, file: !61, line: 36, baseType: !64, size: 256, align: 32)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !161, file: !61, line: 37, baseType: !77, size: 512, align: 32, offset: 256)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !161, file: !61, line: 37, baseType: !77, size: 512, align: 32, offset: 768)
!166 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !168)
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "T", type: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !171)
!171 = !{!172, !173, !174, !175, !183}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !170, file: !21, line: 162, baseType: !77, size: 512, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !170, file: !21, line: 162, baseType: !77, size: 512, align: 32, offset: 512)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !170, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !170, file: !21, line: 164, baseType: !176, size: 2048, align: 32, offset: 1152)
!176 = !DICompositeType(tag: DW_TAG_array_type, baseType: !177, size: 2048, align: 32, elements: !181)
!177 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !178)
!178 = !{!179, !180}
!179 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !177, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !177, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!181 = !{!182}
!182 = !DISubrange(count: 8)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !170, file: !21, line: 165, baseType: !70, size: 32, align: 32, offset: 3200)
!184 = !{i32 2, !"Dwarf Version", i32 4}
!185 = !{i32 2, !"Debug Info Version", i32 3}
!186 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!187 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_Geom_00_PS_P.vs.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0APSInput_P main( in STg2_KN_GPU_Vertex_Geom_00 input )\0A{\0A    PSInput_P result;\0A\0A    result.pos_w = mul(float4(input.m_vS0.xyz, 1.0f),Debug_Model.m_vModel_Transform).xyz;\0A    result.pos_v = mul(float4(result.pos_w, 1.0f),Debug_Model.m_mW2C).xyz;\0A    result.pos_p = mul(float4(result.pos_v, 1.0f),Debug_Model.m_mC2S);\0A\0A    return result;\0A}\0A"}
