#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyz         1     NONE   float       
; POSITION                 1   xyz         2     NONE   float       
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 737e5b1ef9a768f3cd29358064e482a4.pdb
; shader hash: 737e5b1ef9a768f3cd29358064e482a4
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       
; POSITION                 1                 linear       
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !55)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_P.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !34, !50, !53, !54}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_P", file: !21, line: 118, size: 320, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 120, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 121, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 122, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !35, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!35 = !DISubroutineType(types: !36)
!36 = !{!25, !25, !37}
!37 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !38, line: 21, size: 256, align: 32, elements: !39)
!38 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!39 = !{!40, !41, !42, !43, !46, !47, !48, !49}
!40 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !37, file: !38, line: 23, baseType: !8, size: 32, align: 32)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !37, file: !38, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !37, file: !38, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !37, file: !38, line: 26, baseType: !44, size: 32, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !45)
!45 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !37, file: !38, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !37, file: !38, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !37, file: !38, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !37, file: !38, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!50 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !51, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!51 = !DISubroutineType(types: !52)
!52 = !{!25, !25}
!53 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !51, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!54 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !51, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!55 = !{!56, !63, !66, !71, !73, !113, !127, !151, !161, !170, !188, !190}
!56 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !57, isLocal: false, isDefinition: true)
!57 = !DICompositeType(tag: DW_TAG_array_type, baseType: !58, size: 512, align: 32, elements: !61)
!58 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !59)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "element", type: !5)
!61 = !{!62}
!62 = !DISubrange(count: 4)
!63 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 640, align: 32, elements: !61)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !59)
!66 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !67, isLocal: false, isDefinition: true)
!67 = !DICompositeType(tag: DW_TAG_array_type, baseType: !68, size: 5120, align: 32, elements: !69)
!68 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !59)
!69 = !{!70}
!70 = !DISubrange(count: 32)
!71 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!73 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !75)
!75 = !{!76}
!76 = !DITemplateTypeParameter(name: "T", type: !77)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !38, line: 71, size: 42624, align: 32, elements: !78)
!78 = !{!79, !80, !103, !104, !105, !106, !107, !111}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !77, file: !38, line: 73, baseType: !37, size: 256, align: 32)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !77, file: !38, line: 74, baseType: !81, size: 512, align: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !83, templateParams: !100)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!100 = !{!13, !101, !102}
!101 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!102 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !77, file: !38, line: 74, baseType: !81, size: 512, align: 32, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !77, file: !38, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !77, file: !38, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !77, file: !38, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !77, file: !38, line: 78, baseType: !108, size: 32768, align: 32, offset: 1664)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32768, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !77, file: !38, line: 79, baseType: !112, size: 8192, align: 32, offset: 34432)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !109)
!113 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !38, line: 60, size: 2304, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !117, file: !38, line: 62, baseType: !37, size: 256, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !117, file: !38, line: 63, baseType: !81, size: 512, align: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !117, file: !38, line: 63, baseType: !81, size: 512, align: 32, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !117, file: !38, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !117, file: !38, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !117, file: !38, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !117, file: !38, line: 67, baseType: !81, size: 512, align: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !117, file: !38, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!127 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !129)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !38, line: 48, size: 17152, align: 32, elements: !132)
!132 = !{!133, !134, !135, !136, !144, !145, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !131, file: !38, line: 50, baseType: !37, size: 256, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !131, file: !38, line: 51, baseType: !44, size: 32, align: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !131, file: !38, line: 52, baseType: !44, size: 32, align: 32, offset: 288)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !131, file: !38, line: 53, baseType: !137, size: 64, align: 32, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !139, templateParams: !142)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !138, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !138, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!142 = !{!13, !143}
!143 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !131, file: !38, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !131, file: !38, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !131, file: !38, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !131, file: !38, line: 57, baseType: !148, size: 16384, align: 32, offset: 768)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 128)
!151 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "T", type: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !38, line: 40, size: 544, align: 32, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !155, file: !38, line: 42, baseType: !37, size: 256, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !155, file: !38, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !155, file: !38, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !155, file: !38, line: 45, baseType: !44, size: 32, align: 32, offset: 512)
!161 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !163)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !38, line: 34, size: 1280, align: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !165, file: !38, line: 36, baseType: !37, size: 256, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !165, file: !38, line: 37, baseType: !81, size: 512, align: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !165, file: !38, line: 37, baseType: !81, size: 512, align: 32, offset: 768)
!170 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "T", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !175)
!175 = !{!176, !177, !178, !179, !187}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !174, file: !21, line: 162, baseType: !81, size: 512, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !174, file: !21, line: 162, baseType: !81, size: 512, align: 32, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !174, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !174, file: !21, line: 164, baseType: !180, size: 2048, align: 32, offset: 1152)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, align: 32, elements: !185)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !181, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !181, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !174, file: !21, line: 165, baseType: !44, size: 32, align: 32, offset: 3200)
!188 = !DIGlobalVariable(name: "st2084_max_nits", scope: !34, file: !21, line: 228, type: !189, isLocal: true, isDefinition: true)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!190 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !50, file: !21, line: 180, type: !191, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !194, templateParams: !204)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!204 = !{!13, !205, !206}
!205 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!206 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!210 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_P.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_P input) : SV_TARGET\0A{\0A    float3 colour = HDRCorrection( Debug_Model.m_uModel_Colour.rgb, Debug_Model.m_sDESC );\0A    return float4( colour, 1.0f );\0A}"}
