#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyz 
; TANGENT                  0   xyzw        1     NONE   float       
; TANGENT                  1   xyzw        2     NONE   float       
; TEXCOORD                 0   xyzw        3     NONE   float       
; COLOR                    0   xyzw        4     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; POSITION                 1   xyz         2     NONE   float   xyz 
; COLOR                    0   xyzw        3     NONE   float   xyzw
;
; shader debug name: a01a0aa57de6b826b0255a7d06bac522.pdb
; shader hash: a01a0aa57de6b826b0255a7d06bac522
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 5
; SigOutputElements: 4
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 5
; SigOutputVectors[0]: 4
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !43)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Particle_01_PS_FX.vs.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !35}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_PC", file: !21, line: 134, size: 448, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33, !34}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 136, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 137, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 138, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 139, baseType: !4, size: 128, align: 32, offset: 320)
!35 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_Vertex_Particle_01", file: !36, line: 82, size: 640, align: 32, elements: !37)
!36 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Vertex].h", directory: "")
!37 = !{!38, !39, !40, !41, !42}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "m_vS0", scope: !35, file: !36, line: 83, baseType: !4, size: 128, align: 32)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "m_vT0", scope: !35, file: !36, line: 84, baseType: !4, size: 128, align: 32, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "m_vB0", scope: !35, file: !36, line: 85, baseType: !4, size: 128, align: 32, offset: 256)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUV", scope: !35, file: !36, line: 86, baseType: !4, size: 128, align: 32, offset: 384)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "m_vCL", scope: !35, file: !36, line: 87, baseType: !4, size: 128, align: 32, offset: 512)
!43 = !{!44, !51, !54, !59, !61, !114, !128, !152, !162, !171}
!44 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !45, isLocal: false, isDefinition: true)
!45 = !DICompositeType(tag: DW_TAG_array_type, baseType: !46, size: 512, align: 32, elements: !49)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !47)
!47 = !{!48}
!48 = !DITemplateTypeParameter(name: "element", type: !5)
!49 = !{!50}
!50 = !DISubrange(count: 4)
!51 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !52, isLocal: false, isDefinition: true)
!52 = !DICompositeType(tag: DW_TAG_array_type, baseType: !53, size: 640, align: 32, elements: !49)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !47)
!54 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !55, isLocal: false, isDefinition: true)
!55 = !DICompositeType(tag: DW_TAG_array_type, baseType: !56, size: 5120, align: 32, elements: !57)
!56 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !47)
!57 = !{!58}
!58 = !DISubrange(count: 32)
!59 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !60, isLocal: false, isDefinition: true)
!60 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!61 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !63)
!63 = !{!64}
!64 = !DITemplateTypeParameter(name: "T", type: !65)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !66, line: 71, size: 42624, align: 32, elements: !67)
!66 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!67 = !{!68, !81, !104, !105, !106, !107, !108, !112}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !65, file: !66, line: 73, baseType: !69, size: 256, align: 32)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !66, line: 21, size: 256, align: 32, elements: !70)
!70 = !{!71, !72, !73, !74, !77, !78, !79, !80}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !69, file: !66, line: 23, baseType: !8, size: 32, align: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !69, file: !66, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !69, file: !66, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !69, file: !66, line: 26, baseType: !75, size: 32, align: 32, offset: 96)
!75 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !76)
!76 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !69, file: !66, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !69, file: !66, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !69, file: !66, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !69, file: !66, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !65, file: !66, line: 74, baseType: !82, size: 512, align: 32, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !84, templateParams: !101)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!101 = !{!13, !102, !103}
!102 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!103 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !65, file: !66, line: 74, baseType: !82, size: 512, align: 32, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !65, file: !66, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !65, file: !66, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !65, file: !66, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !65, file: !66, line: 78, baseType: !109, size: 32768, align: 32, offset: 1664)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 32768, align: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !65, file: !66, line: 79, baseType: !113, size: 8192, align: 32, offset: 34432)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !110)
!114 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !116)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "T", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !66, line: 60, size: 2304, align: 32, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !118, file: !66, line: 62, baseType: !69, size: 256, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !118, file: !66, line: 63, baseType: !82, size: 512, align: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !118, file: !66, line: 63, baseType: !82, size: 512, align: 32, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !118, file: !66, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !118, file: !66, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !118, file: !66, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !118, file: !66, line: 67, baseType: !82, size: 512, align: 32, offset: 1664)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !118, file: !66, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!128 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !130)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !66, line: 48, size: 17152, align: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !145, !146, !147, !148}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !132, file: !66, line: 50, baseType: !69, size: 256, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !132, file: !66, line: 51, baseType: !75, size: 32, align: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !132, file: !66, line: 52, baseType: !75, size: 32, align: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !132, file: !66, line: 53, baseType: !138, size: 64, align: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !140, templateParams: !143)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !139, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !139, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!143 = !{!13, !144}
!144 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !132, file: !66, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !132, file: !66, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !132, file: !66, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !132, file: !66, line: 57, baseType: !149, size: 16384, align: 32, offset: 768)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 128)
!152 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !154)
!154 = !{!155}
!155 = !DITemplateTypeParameter(name: "T", type: !156)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !66, line: 40, size: 544, align: 32, elements: !157)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !156, file: !66, line: 42, baseType: !69, size: 256, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !156, file: !66, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !156, file: !66, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !156, file: !66, line: 45, baseType: !75, size: 32, align: 32, offset: 512)
!162 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !163, isLocal: false, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !164)
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "T", type: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !66, line: 34, size: 1280, align: 32, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !166, file: !66, line: 36, baseType: !69, size: 256, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !166, file: !66, line: 37, baseType: !82, size: 512, align: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !166, file: !66, line: 37, baseType: !82, size: 512, align: 32, offset: 768)
!171 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !173)
!173 = !{!174}
!174 = !DITemplateTypeParameter(name: "T", type: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !176)
!176 = !{!177, !178, !179, !180, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !175, file: !21, line: 162, baseType: !82, size: 512, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !175, file: !21, line: 162, baseType: !82, size: 512, align: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !175, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !175, file: !21, line: 164, baseType: !181, size: 2048, align: 32, offset: 1152)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 2048, align: 32, elements: !186)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !182, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !182, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !175, file: !21, line: 165, baseType: !75, size: 32, align: 32, offset: 3200)
!189 = !{i32 2, !"Dwarf Version", i32 4}
!190 = !{i32 2, !"Debug Info Version", i32 3}
!191 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!192 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Particle_01_PS_FX.vs.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0APSInput_PC main( in STg2_KN_GPU_Vertex_Particle_01 input )\0A{\0A    PSInput_PC result;\0A\0A    result.pos_w = mul(float4(input.m_vS0.xyz, 1.0f),Debug_Model.m_vModel_Transform).xyz;\0A    result.pos_v = mul(float4(result.pos_w, 1.0f),Debug_Model.m_mW2C).xyz;\0A    result.pos_p = mul(float4(result.pos_v, 1.0f),Debug_Model.m_mC2S);\0A    result.colour = input.m_vCL;\0A\0A    return result;\0A}\0A"}
