#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xy          0     NONE   float   xy  
; TEXCOORD                 0   xy          1     NONE   float   xy  
; SV_InstanceID            0   x           2   INSTID    uint   x   
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
; shader debug name: 82f5203e0ee82536c2781325a501233d.pdb
; shader hash: 82f5203e0ee82536c2781325a501233d
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 2
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 2
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; TEXCOORD                 0                              

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !39)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_UI_Text_PS_UIT.vs.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !5, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !31}
!7 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_UI_Text", file: !8, line: 104, size: 192, align: 32, elements: !9)
!8 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!9 = !{!10, !23}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !7, file: !8, line: 106, baseType: !11, size: 128, align: 32)
!11 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !12)
!12 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !13, templateParams: !19)
!13 = !{!14, !16, !17, !18}
!14 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !12, file: !1, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!15 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !12, file: !1, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !12, file: !1, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !12, file: !1, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!19 = !{!20, !21}
!20 = !DITemplateTypeParameter(name: "element", type: !15)
!21 = !DITemplateValueParameter(name: "element_count", type: !22, value: i32 4)
!22 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !7, file: !8, line: 107, baseType: !24, size: 64, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !26, templateParams: !29)
!26 = !{!27, !28}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !{!20, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !22, value: i32 2)
!31 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_Instance_Vertex_UI_Text", file: !32, line: 32, size: 160, align: 32, elements: !33)
!32 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Vertex].h", directory: "")
!33 = !{!34, !35, !36}
!34 = !DIDerivedType(tag: DW_TAG_member, name: "m_vS0", scope: !31, file: !32, line: 33, baseType: !24, size: 64, align: 32)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUV0", scope: !31, file: !32, line: 34, baseType: !24, size: 64, align: 32, offset: 64)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "InstanceId", scope: !31, file: !32, line: 35, baseType: !37, size: 32, align: 32, offset: 128)
!37 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, baseType: !38)
!38 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!39 = !{!40, !47, !50, !55, !57, !108, !122, !139, !149, !158}
!40 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !8, line: 87, type: !41, isLocal: false, isDefinition: true)
!41 = !DICompositeType(tag: DW_TAG_array_type, baseType: !42, size: 512, align: 32, elements: !45)
!42 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !43)
!43 = !{!44}
!44 = !DITemplateTypeParameter(name: "element", type: !12)
!45 = !{!46}
!46 = !DISubrange(count: 4)
!47 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !8, line: 88, type: !48, isLocal: false, isDefinition: true)
!48 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 640, align: 32, elements: !45)
!49 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !43)
!50 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !8, line: 89, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 5120, align: 32, elements: !53)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !43)
!53 = !{!54}
!54 = !DISubrange(count: 32)
!55 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !8, line: 90, type: !56, isLocal: false, isDefinition: true)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!57 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !8, line: 146, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !59)
!59 = !{!60}
!60 = !DITemplateTypeParameter(name: "T", type: !61)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !62, line: 71, size: 42624, align: 32, elements: !63)
!62 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!63 = !{!64, !75, !98, !99, !100, !101, !102, !106}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !61, file: !62, line: 73, baseType: !65, size: 256, align: 32)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !62, line: 21, size: 256, align: 32, elements: !66)
!66 = !{!67, !68, !69, !70, !71, !72, !73, !74}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !65, file: !62, line: 23, baseType: !15, size: 32, align: 32)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !65, file: !62, line: 24, baseType: !15, size: 32, align: 32, offset: 32)
!69 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !65, file: !62, line: 25, baseType: !22, size: 32, align: 32, offset: 64)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !65, file: !62, line: 26, baseType: !37, size: 32, align: 32, offset: 96)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !65, file: !62, line: 28, baseType: !15, size: 32, align: 32, offset: 128)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !65, file: !62, line: 29, baseType: !15, size: 32, align: 32, offset: 160)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !65, file: !62, line: 30, baseType: !15, size: 32, align: 32, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !65, file: !62, line: 31, baseType: !15, size: 32, align: 32, offset: 224)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !61, file: !62, line: 74, baseType: !76, size: 512, align: 32, offset: 256)
!76 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !77)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !78, templateParams: !95)
!78 = !{!79, !80, !81, !82, !83, !84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, flags: DIFlagPublic)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !77, file: !1, line: 146, baseType: !15, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!95 = !{!20, !96, !97}
!96 = !DITemplateValueParameter(name: "row_count", type: !22, value: i32 4)
!97 = !DITemplateValueParameter(name: "col_count", type: !22, value: i32 4)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !61, file: !62, line: 74, baseType: !76, size: 512, align: 32, offset: 768)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !61, file: !62, line: 75, baseType: !11, size: 128, align: 32, offset: 1280)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !61, file: !62, line: 76, baseType: !11, size: 128, align: 32, offset: 1408)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !61, file: !62, line: 77, baseType: !11, size: 128, align: 32, offset: 1536)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !61, file: !62, line: 78, baseType: !103, size: 32768, align: 32, offset: 1664)
!103 = !DICompositeType(tag: DW_TAG_array_type, baseType: !76, size: 32768, align: 32, elements: !104)
!104 = !{!105}
!105 = !DISubrange(count: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !61, file: !62, line: 79, baseType: !107, size: 8192, align: 32, offset: 34432)
!107 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 8192, align: 32, elements: !104)
!108 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !8, line: 147, type: !109, isLocal: false, isDefinition: true)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "T", type: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !62, line: 60, size: 2304, align: 32, elements: !113)
!113 = !{!114, !115, !116, !117, !118, !119, !120, !121}
!114 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !112, file: !62, line: 62, baseType: !65, size: 256, align: 32)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !112, file: !62, line: 63, baseType: !76, size: 512, align: 32, offset: 256)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !112, file: !62, line: 63, baseType: !76, size: 512, align: 32, offset: 768)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !112, file: !62, line: 64, baseType: !11, size: 128, align: 32, offset: 1280)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !112, file: !62, line: 65, baseType: !11, size: 128, align: 32, offset: 1408)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !112, file: !62, line: 66, baseType: !11, size: 128, align: 32, offset: 1536)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !112, file: !62, line: 67, baseType: !76, size: 512, align: 32, offset: 1664)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !112, file: !62, line: 68, baseType: !11, size: 128, align: 32, offset: 2176)
!122 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !8, line: 148, type: !123, isLocal: false, isDefinition: true)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !124)
!124 = !{!125}
!125 = !DITemplateTypeParameter(name: "T", type: !126)
!126 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !62, line: 48, size: 17152, align: 32, elements: !127)
!127 = !{!128, !129, !130, !131, !132, !133, !134, !135}
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !126, file: !62, line: 50, baseType: !65, size: 256, align: 32)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !126, file: !62, line: 51, baseType: !37, size: 32, align: 32, offset: 256)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !126, file: !62, line: 52, baseType: !37, size: 32, align: 32, offset: 288)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !126, file: !62, line: 53, baseType: !24, size: 64, align: 32, offset: 320)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !126, file: !62, line: 54, baseType: !11, size: 128, align: 32, offset: 384)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !126, file: !62, line: 55, baseType: !11, size: 128, align: 32, offset: 512)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !126, file: !62, line: 56, baseType: !11, size: 128, align: 32, offset: 640)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !126, file: !62, line: 57, baseType: !136, size: 16384, align: 32, offset: 768)
!136 = !DICompositeType(tag: DW_TAG_array_type, baseType: !11, size: 16384, align: 32, elements: !137)
!137 = !{!138}
!138 = !DISubrange(count: 128)
!139 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !8, line: 149, type: !140, isLocal: false, isDefinition: true)
!140 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !141)
!141 = !{!142}
!142 = !DITemplateTypeParameter(name: "T", type: !143)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !62, line: 40, size: 544, align: 32, elements: !144)
!144 = !{!145, !146, !147, !148}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !143, file: !62, line: 42, baseType: !65, size: 256, align: 32)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !143, file: !62, line: 43, baseType: !11, size: 128, align: 32, offset: 256)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !143, file: !62, line: 44, baseType: !11, size: 128, align: 32, offset: 384)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !143, file: !62, line: 45, baseType: !37, size: 32, align: 32, offset: 512)
!149 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !8, line: 150, type: !150, isLocal: false, isDefinition: true)
!150 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !151)
!151 = !{!152}
!152 = !DITemplateTypeParameter(name: "T", type: !153)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !62, line: 34, size: 1280, align: 32, elements: !154)
!154 = !{!155, !156, !157}
!155 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !153, file: !62, line: 36, baseType: !65, size: 256, align: 32)
!156 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !153, file: !62, line: 37, baseType: !76, size: 512, align: 32, offset: 256)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !153, file: !62, line: 37, baseType: !76, size: 512, align: 32, offset: 768)
!158 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !8, line: 167, type: !159, isLocal: false, isDefinition: true)
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !160)
!160 = !{!161}
!161 = !DITemplateTypeParameter(name: "T", type: !162)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !8, line: 160, size: 3232, align: 32, elements: !163)
!163 = !{!164, !165, !166, !167, !175}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !162, file: !8, line: 162, baseType: !76, size: 512, align: 32)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !162, file: !8, line: 162, baseType: !76, size: 512, align: 32, offset: 512)
!166 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !162, file: !8, line: 163, baseType: !11, size: 128, align: 32, offset: 1024)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !162, file: !8, line: 164, baseType: !168, size: 2048, align: 32, offset: 1152)
!168 = !DICompositeType(tag: DW_TAG_array_type, baseType: !169, size: 2048, align: 32, elements: !173)
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !8, line: 153, size: 256, align: 32, elements: !170)
!170 = !{!171, !172}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !169, file: !8, line: 155, baseType: !11, size: 128, align: 32)
!172 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !169, file: !8, line: 156, baseType: !11, size: 128, align: 32, offset: 128)
!173 = !{!174}
!174 = !DISubrange(count: 8)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !162, file: !8, line: 165, baseType: !37, size: 32, align: 32, offset: 3200)
!176 = !{i32 2, !"Dwarf Version", i32 4}
!177 = !{i32 2, !"Debug Info Version", i32 3}
!178 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!179 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_UI_Text_PS_UIT.vs.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0APSInput_UI_Text main( in STg2_KN_GPU_Instance_Vertex_UI_Text input )\0A{\0A    PSInput_UI_Text result;\0A\0A    result.pos_v.xy = Debug_Text.m_vText_Offset[input.InstanceId].xy + input.m_vS0.xy * Debug_Text.m_vFont_Glyph_Scale_S.xy;\0A    result.pos_v.z = 0.0F;\0A    result.pos_v.w = 1.0F;\0A    result.uv.xy = input.m_vUV0.xy * Debug_Text.m_vFont_Glyph_Scale_UV.xy + Debug_Text.m_vFont_Glyph_Scale_UV.zw * Debug_Text.m_vText_Offset[input.InstanceId].zw;\0A\0A    return result;\0A}\0A"}
