#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyz         1     NONE   float       
; POSITION                 1   xyz         2     NONE   float       
; COLOR                    0   xyzw        3     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 73ccc827e5121c9184a8bfe3eb6a5c91.pdb
; shader hash: 73ccc827e5121c9184a8bfe3eb6a5c91
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 4
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 4
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; POSITION                 0                 linear       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !56)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_PC.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !35, !51, !54, !55}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_PC", file: !21, line: 134, size: 448, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33, !34}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 136, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 137, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 138, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 139, baseType: !4, size: 128, align: 32, offset: 320)
!35 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !36, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!36 = !DISubroutineType(types: !37)
!37 = !{!25, !25, !38}
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !39, line: 21, size: 256, align: 32, elements: !40)
!39 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!40 = !{!41, !42, !43, !44, !47, !48, !49, !50}
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !38, file: !39, line: 23, baseType: !8, size: 32, align: 32)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !38, file: !39, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !38, file: !39, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !38, file: !39, line: 26, baseType: !45, size: 32, align: 32, offset: 96)
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !46)
!46 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !38, file: !39, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !38, file: !39, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !38, file: !39, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !38, file: !39, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!51 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !52, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!52 = !DISubroutineType(types: !53)
!53 = !{!25, !25}
!54 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !52, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !52, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!56 = !{!57, !64, !67, !72, !74, !114, !128, !152, !162, !171, !189, !191}
!57 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !58, isLocal: false, isDefinition: true)
!58 = !DICompositeType(tag: DW_TAG_array_type, baseType: !59, size: 512, align: 32, elements: !62)
!59 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !60)
!60 = !{!61}
!61 = !DITemplateTypeParameter(name: "element", type: !5)
!62 = !{!63}
!63 = !DISubrange(count: 4)
!64 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !65, isLocal: false, isDefinition: true)
!65 = !DICompositeType(tag: DW_TAG_array_type, baseType: !66, size: 640, align: 32, elements: !62)
!66 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !60)
!67 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !68, isLocal: false, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_array_type, baseType: !69, size: 5120, align: 32, elements: !70)
!69 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !60)
!70 = !{!71}
!71 = !DISubrange(count: 32)
!72 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!74 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !76)
!76 = !{!77}
!77 = !DITemplateTypeParameter(name: "T", type: !78)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !39, line: 71, size: 42624, align: 32, elements: !79)
!79 = !{!80, !81, !104, !105, !106, !107, !108, !112}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !78, file: !39, line: 73, baseType: !38, size: 256, align: 32)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !78, file: !39, line: 74, baseType: !82, size: 512, align: 32, offset: 256)
!82 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !83)
!83 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !84, templateParams: !101)
!84 = !{!85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !83, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!101 = !{!13, !102, !103}
!102 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!103 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !78, file: !39, line: 74, baseType: !82, size: 512, align: 32, offset: 768)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !78, file: !39, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !78, file: !39, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !78, file: !39, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !78, file: !39, line: 78, baseType: !109, size: 32768, align: 32, offset: 1664)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !82, size: 32768, align: 32, elements: !110)
!110 = !{!111}
!111 = !DISubrange(count: 64)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !78, file: !39, line: 79, baseType: !113, size: 8192, align: 32, offset: 34432)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !110)
!114 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !115, isLocal: false, isDefinition: true)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !116)
!116 = !{!117}
!117 = !DITemplateTypeParameter(name: "T", type: !118)
!118 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !39, line: 60, size: 2304, align: 32, elements: !119)
!119 = !{!120, !121, !122, !123, !124, !125, !126, !127}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !118, file: !39, line: 62, baseType: !38, size: 256, align: 32)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !118, file: !39, line: 63, baseType: !82, size: 512, align: 32, offset: 256)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !118, file: !39, line: 63, baseType: !82, size: 512, align: 32, offset: 768)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !118, file: !39, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !118, file: !39, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !118, file: !39, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !118, file: !39, line: 67, baseType: !82, size: 512, align: 32, offset: 1664)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !118, file: !39, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!128 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !129, isLocal: false, isDefinition: true)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !130)
!130 = !{!131}
!131 = !DITemplateTypeParameter(name: "T", type: !132)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !39, line: 48, size: 17152, align: 32, elements: !133)
!133 = !{!134, !135, !136, !137, !145, !146, !147, !148}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !132, file: !39, line: 50, baseType: !38, size: 256, align: 32)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !132, file: !39, line: 51, baseType: !45, size: 32, align: 32, offset: 256)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !132, file: !39, line: 52, baseType: !45, size: 32, align: 32, offset: 288)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !132, file: !39, line: 53, baseType: !138, size: 64, align: 32, offset: 320)
!138 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !139)
!139 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !140, templateParams: !143)
!140 = !{!141, !142}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !139, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !139, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!143 = !{!13, !144}
!144 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !132, file: !39, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !132, file: !39, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !132, file: !39, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !132, file: !39, line: 57, baseType: !149, size: 16384, align: 32, offset: 768)
!149 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !150)
!150 = !{!151}
!151 = !DISubrange(count: 128)
!152 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !153, isLocal: false, isDefinition: true)
!153 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !154)
!154 = !{!155}
!155 = !DITemplateTypeParameter(name: "T", type: !156)
!156 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !39, line: 40, size: 544, align: 32, elements: !157)
!157 = !{!158, !159, !160, !161}
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !156, file: !39, line: 42, baseType: !38, size: 256, align: 32)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !156, file: !39, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !156, file: !39, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !156, file: !39, line: 45, baseType: !45, size: 32, align: 32, offset: 512)
!162 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !163, isLocal: false, isDefinition: true)
!163 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !164)
!164 = !{!165}
!165 = !DITemplateTypeParameter(name: "T", type: !166)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !39, line: 34, size: 1280, align: 32, elements: !167)
!167 = !{!168, !169, !170}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !166, file: !39, line: 36, baseType: !38, size: 256, align: 32)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !166, file: !39, line: 37, baseType: !82, size: 512, align: 32, offset: 256)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !166, file: !39, line: 37, baseType: !82, size: 512, align: 32, offset: 768)
!171 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !172, isLocal: false, isDefinition: true)
!172 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !173)
!173 = !{!174}
!174 = !DITemplateTypeParameter(name: "T", type: !175)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !176)
!176 = !{!177, !178, !179, !180, !188}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !175, file: !21, line: 162, baseType: !82, size: 512, align: 32)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !175, file: !21, line: 162, baseType: !82, size: 512, align: 32, offset: 512)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !175, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !175, file: !21, line: 164, baseType: !181, size: 2048, align: 32, offset: 1152)
!181 = !DICompositeType(tag: DW_TAG_array_type, baseType: !182, size: 2048, align: 32, elements: !186)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !183)
!183 = !{!184, !185}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !182, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !182, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!186 = !{!187}
!187 = !DISubrange(count: 8)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !175, file: !21, line: 165, baseType: !45, size: 32, align: 32, offset: 3200)
!189 = !DIGlobalVariable(name: "st2084_max_nits", scope: !35, file: !21, line: 228, type: !190, isLocal: true, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!191 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !51, file: !21, line: 180, type: !192, isLocal: false, isDefinition: true)
!192 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !193)
!193 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !194)
!194 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !195, templateParams: !205)
!195 = !{!196, !197, !198, !199, !200, !201, !202, !203, !204}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !194, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!205 = !{!13, !206, !207}
!206 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!207 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!208 = !{i32 2, !"Dwarf Version", i32 4}
!209 = !{i32 2, !"Debug Info Version", i32 3}
!210 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!211 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_PC.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_PC input) : SV_TARGET\0A{\0A    float3 colour = HDRCorrection( input.colour.rgb, Debug_Model.m_sDESC );\0A    return float4( colour, 1.0f );\0A}"}
