#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: e9c713e19e01a6f39e877f13b7ed7fc2.pdb
; shader hash: e9c713e19e01a6f39e877f13b7ed7fc2
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 2
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 2
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !61)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_UIT.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !32, !56, !59, !60}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_UI_Text", file: !21, line: 104, size: 192, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 106, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !21, line: 107, baseType: !25, size: 64, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !33, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!33 = !DISubroutineType(types: !34)
!34 = !{!35, !35, !43}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 6, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 6, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 6, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 6, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!13, !42}
!42 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!43 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !44, line: 21, size: 256, align: 32, elements: !45)
!44 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!45 = !{!46, !47, !48, !49, !52, !53, !54, !55}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !43, file: !44, line: 23, baseType: !8, size: 32, align: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !43, file: !44, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !43, file: !44, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !43, file: !44, line: 26, baseType: !50, size: 32, align: 32, offset: 96)
!50 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !51)
!51 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !43, file: !44, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !43, file: !44, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !43, file: !44, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !43, file: !44, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!56 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !57, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!57 = !DISubroutineType(types: !58)
!58 = !{!35, !35}
!59 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !57, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!60 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !57, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!61 = !{!62, !69, !72, !77, !79, !119, !133, !150, !160, !169, !187, !189}
!62 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !63, isLocal: false, isDefinition: true)
!63 = !DICompositeType(tag: DW_TAG_array_type, baseType: !64, size: 512, align: 32, elements: !67)
!64 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !65)
!65 = !{!66}
!66 = !DITemplateTypeParameter(name: "element", type: !5)
!67 = !{!68}
!68 = !DISubrange(count: 4)
!69 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !70, isLocal: false, isDefinition: true)
!70 = !DICompositeType(tag: DW_TAG_array_type, baseType: !71, size: 640, align: 32, elements: !67)
!71 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !65)
!72 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !73, isLocal: false, isDefinition: true)
!73 = !DICompositeType(tag: DW_TAG_array_type, baseType: !74, size: 5120, align: 32, elements: !75)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !65)
!75 = !{!76}
!76 = !DISubrange(count: 32)
!77 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !78, isLocal: false, isDefinition: true)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!79 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !80, isLocal: false, isDefinition: true)
!80 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !81)
!81 = !{!82}
!82 = !DITemplateTypeParameter(name: "T", type: !83)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !44, line: 71, size: 42624, align: 32, elements: !84)
!84 = !{!85, !86, !109, !110, !111, !112, !113, !117}
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !83, file: !44, line: 73, baseType: !43, size: 256, align: 32)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !83, file: !44, line: 74, baseType: !87, size: 512, align: 32, offset: 256)
!87 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !88)
!88 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !89, templateParams: !106)
!89 = !{!90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !88, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!106 = !{!13, !107, !108}
!107 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!108 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !83, file: !44, line: 74, baseType: !87, size: 512, align: 32, offset: 768)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !83, file: !44, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !83, file: !44, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !83, file: !44, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !83, file: !44, line: 78, baseType: !114, size: 32768, align: 32, offset: 1664)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !87, size: 32768, align: 32, elements: !115)
!115 = !{!116}
!116 = !DISubrange(count: 64)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !83, file: !44, line: 79, baseType: !118, size: 8192, align: 32, offset: 34432)
!118 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !115)
!119 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !120, isLocal: false, isDefinition: true)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !121)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "T", type: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !44, line: 60, size: 2304, align: 32, elements: !124)
!124 = !{!125, !126, !127, !128, !129, !130, !131, !132}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !123, file: !44, line: 62, baseType: !43, size: 256, align: 32)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !123, file: !44, line: 63, baseType: !87, size: 512, align: 32, offset: 256)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !123, file: !44, line: 63, baseType: !87, size: 512, align: 32, offset: 768)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !123, file: !44, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !123, file: !44, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !123, file: !44, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !123, file: !44, line: 67, baseType: !87, size: 512, align: 32, offset: 1664)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !123, file: !44, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!133 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !134, isLocal: false, isDefinition: true)
!134 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !135)
!135 = !{!136}
!136 = !DITemplateTypeParameter(name: "T", type: !137)
!137 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !44, line: 48, size: 17152, align: 32, elements: !138)
!138 = !{!139, !140, !141, !142, !143, !144, !145, !146}
!139 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !137, file: !44, line: 50, baseType: !43, size: 256, align: 32)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !137, file: !44, line: 51, baseType: !50, size: 32, align: 32, offset: 256)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !137, file: !44, line: 52, baseType: !50, size: 32, align: 32, offset: 288)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !137, file: !44, line: 53, baseType: !25, size: 64, align: 32, offset: 320)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !137, file: !44, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !137, file: !44, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !137, file: !44, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !137, file: !44, line: 57, baseType: !147, size: 16384, align: 32, offset: 768)
!147 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !148)
!148 = !{!149}
!149 = !DISubrange(count: 128)
!150 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !151, isLocal: false, isDefinition: true)
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !152)
!152 = !{!153}
!153 = !DITemplateTypeParameter(name: "T", type: !154)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !44, line: 40, size: 544, align: 32, elements: !155)
!155 = !{!156, !157, !158, !159}
!156 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !154, file: !44, line: 42, baseType: !43, size: 256, align: 32)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !154, file: !44, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !154, file: !44, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !154, file: !44, line: 45, baseType: !50, size: 32, align: 32, offset: 512)
!160 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !161, isLocal: false, isDefinition: true)
!161 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !162)
!162 = !{!163}
!163 = !DITemplateTypeParameter(name: "T", type: !164)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !44, line: 34, size: 1280, align: 32, elements: !165)
!165 = !{!166, !167, !168}
!166 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !164, file: !44, line: 36, baseType: !43, size: 256, align: 32)
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !164, file: !44, line: 37, baseType: !87, size: 512, align: 32, offset: 256)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !164, file: !44, line: 37, baseType: !87, size: 512, align: 32, offset: 768)
!169 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !170, isLocal: false, isDefinition: true)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !171)
!171 = !{!172}
!172 = !DITemplateTypeParameter(name: "T", type: !173)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !174)
!174 = !{!175, !176, !177, !178, !186}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !173, file: !21, line: 162, baseType: !87, size: 512, align: 32)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !173, file: !21, line: 162, baseType: !87, size: 512, align: 32, offset: 512)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !173, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !173, file: !21, line: 164, baseType: !179, size: 2048, align: 32, offset: 1152)
!179 = !DICompositeType(tag: DW_TAG_array_type, baseType: !180, size: 2048, align: 32, elements: !184)
!180 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !181)
!181 = !{!182, !183}
!182 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !180, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !180, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!184 = !{!185}
!185 = !DISubrange(count: 8)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !173, file: !21, line: 165, baseType: !50, size: 32, align: 32, offset: 3200)
!187 = !DIGlobalVariable(name: "st2084_max_nits", scope: !32, file: !21, line: 228, type: !188, isLocal: true, isDefinition: true)
!188 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!189 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !56, file: !21, line: 180, type: !190, isLocal: false, isDefinition: true)
!190 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !191)
!191 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !192)
!192 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !193, templateParams: !203)
!193 = !{!194, !195, !196, !197, !198, !199, !200, !201, !202}
!194 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !192, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!203 = !{!13, !204, !205}
!204 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!205 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!206 = !{i32 2, !"Dwarf Version", i32 4}
!207 = !{i32 2, !"Debug Info Version", i32 3}
!208 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!209 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_UIT.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_UI_Text input) : SV_TARGET\0A{\0A    float4 texture_test = g_default_texture_image[Debug_Text.m_uiSelect_Default_Texture_Index].Sample(g_sampler, input.uv);\0A    float3 colour = HDRCorrection( Debug_Text.m_vText_Colour.rgb, Debug_Text.m_sDESC );\0A    return float4( colour, texture_test.a*Debug_Text.m_vText_Colour.a );\0A}"}
