#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyzw        0     NONE   float   xyz 
; NORMAL                   0   xyzw        1     NONE   float   xyz 
; COLOR                    0   xyzw        2     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; POSITION                 0   xyz         1     NONE   float   xyz 
; POSITION                 1   xyz         2     NONE   float   xyz 
; NORMAL                   0   xyz         3     NONE   float   xyz 
; COLOR                    0   xyzw        4     NONE   float   xyzw
;
; shader debug name: 2a2fe75d0e72e0de815c327c9315153b.pdb
; shader hash: 2a2fe75d0e72e0de815c327c9315153b
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Vertex Shader
; OutputPositionPresent=1
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 5
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 5
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !42)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Geom_03_PS_PNC.vs.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !36}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_PNC", file: !21, line: 125, size: 544, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33, !34, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 127, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 128, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 129, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !21, line: 130, baseType: !25, size: 96, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 131, baseType: !4, size: 128, align: 32, offset: 416)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_Vertex_Geom_03", file: !37, line: 66, size: 384, align: 32, elements: !38)
!37 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Vertex].h", directory: "")
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "m_vS0", scope: !36, file: !37, line: 67, baseType: !4, size: 128, align: 32)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "m_vN0", scope: !36, file: !37, line: 68, baseType: !4, size: 128, align: 32, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "m_vCL", scope: !36, file: !37, line: 69, baseType: !4, size: 128, align: 32, offset: 256)
!42 = !{!43, !50, !53, !58, !60, !113, !127, !151, !161, !170}
!43 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !44, isLocal: false, isDefinition: true)
!44 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 32, elements: !48)
!45 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !46)
!46 = !{!47}
!47 = !DITemplateTypeParameter(name: "element", type: !5)
!48 = !{!49}
!49 = !DISubrange(count: 4)
!50 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !51, isLocal: false, isDefinition: true)
!51 = !DICompositeType(tag: DW_TAG_array_type, baseType: !52, size: 640, align: 32, elements: !48)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !46)
!53 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !54, isLocal: false, isDefinition: true)
!54 = !DICompositeType(tag: DW_TAG_array_type, baseType: !55, size: 5120, align: 32, elements: !56)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !46)
!56 = !{!57}
!57 = !DISubrange(count: 32)
!58 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!60 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !61, isLocal: false, isDefinition: true)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !62)
!62 = !{!63}
!63 = !DITemplateTypeParameter(name: "T", type: !64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !65, line: 71, size: 42624, align: 32, elements: !66)
!65 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!66 = !{!67, !80, !103, !104, !105, !106, !107, !111}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !64, file: !65, line: 73, baseType: !68, size: 256, align: 32)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !65, line: 21, size: 256, align: 32, elements: !69)
!69 = !{!70, !71, !72, !73, !76, !77, !78, !79}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !68, file: !65, line: 23, baseType: !8, size: 32, align: 32)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !68, file: !65, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !68, file: !65, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !68, file: !65, line: 26, baseType: !74, size: 32, align: 32, offset: 96)
!74 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !75)
!75 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !68, file: !65, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !68, file: !65, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !68, file: !65, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!79 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !68, file: !65, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !64, file: !65, line: 74, baseType: !81, size: 512, align: 32, offset: 256)
!81 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !82)
!82 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !83, templateParams: !100)
!83 = !{!84, !85, !86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !82, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!100 = !{!13, !101, !102}
!101 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!102 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !64, file: !65, line: 74, baseType: !81, size: 512, align: 32, offset: 768)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !64, file: !65, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !64, file: !65, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !64, file: !65, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !64, file: !65, line: 78, baseType: !108, size: 32768, align: 32, offset: 1664)
!108 = !DICompositeType(tag: DW_TAG_array_type, baseType: !81, size: 32768, align: 32, elements: !109)
!109 = !{!110}
!110 = !DISubrange(count: 64)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !64, file: !65, line: 79, baseType: !112, size: 8192, align: 32, offset: 34432)
!112 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !109)
!113 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !114, isLocal: false, isDefinition: true)
!114 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !115)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !117)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !65, line: 60, size: 2304, align: 32, elements: !118)
!118 = !{!119, !120, !121, !122, !123, !124, !125, !126}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !117, file: !65, line: 62, baseType: !68, size: 256, align: 32)
!120 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !117, file: !65, line: 63, baseType: !81, size: 512, align: 32, offset: 256)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !117, file: !65, line: 63, baseType: !81, size: 512, align: 32, offset: 768)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !117, file: !65, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !117, file: !65, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !117, file: !65, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !117, file: !65, line: 67, baseType: !81, size: 512, align: 32, offset: 1664)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !117, file: !65, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!127 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !128, isLocal: false, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !129)
!129 = !{!130}
!130 = !DITemplateTypeParameter(name: "T", type: !131)
!131 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !65, line: 48, size: 17152, align: 32, elements: !132)
!132 = !{!133, !134, !135, !136, !144, !145, !146, !147}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !131, file: !65, line: 50, baseType: !68, size: 256, align: 32)
!134 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !131, file: !65, line: 51, baseType: !74, size: 32, align: 32, offset: 256)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !131, file: !65, line: 52, baseType: !74, size: 32, align: 32, offset: 288)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !131, file: !65, line: 53, baseType: !137, size: 64, align: 32, offset: 320)
!137 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !138)
!138 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !139, templateParams: !142)
!139 = !{!140, !141}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !138, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !138, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!142 = !{!13, !143}
!143 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !131, file: !65, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !131, file: !65, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !131, file: !65, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !131, file: !65, line: 57, baseType: !148, size: 16384, align: 32, offset: 768)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 128)
!151 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "T", type: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !65, line: 40, size: 544, align: 32, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !155, file: !65, line: 42, baseType: !68, size: 256, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !155, file: !65, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !155, file: !65, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !155, file: !65, line: 45, baseType: !74, size: 32, align: 32, offset: 512)
!161 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !163)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !65, line: 34, size: 1280, align: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !165, file: !65, line: 36, baseType: !68, size: 256, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !165, file: !65, line: 37, baseType: !81, size: 512, align: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !165, file: !65, line: 37, baseType: !81, size: 512, align: 32, offset: 768)
!170 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "T", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !175)
!175 = !{!176, !177, !178, !179, !187}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !174, file: !21, line: 162, baseType: !81, size: 512, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !174, file: !21, line: 162, baseType: !81, size: 512, align: 32, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !174, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !174, file: !21, line: 164, baseType: !180, size: 2048, align: 32, offset: 1152)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, align: 32, elements: !185)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !181, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !181, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !174, file: !21, line: 165, baseType: !74, size: 32, align: 32, offset: 3200)
!188 = !{i32 2, !"Dwarf Version", i32 4}
!189 = !{i32 2, !"Debug Info Version", i32 3}
!190 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!191 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_Geom_03_PS_PNC.vs.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0APSInput_PNC main( in STg2_KN_GPU_Vertex_Geom_03 input )\0A{\0A    PSInput_PNC result;\0A\0A    result.pos_w = mul(float4(input.m_vS0.xyz, 1.0f),Debug_Model.m_vModel_Transform).xyz;\0A    result.pos_v = mul(float4(result.pos_w, 1.0f),Debug_Model.m_mW2C).xyz;\0A    result.pos_p = mul(float4(result.pos_v, 1.0f),Debug_Model.m_mC2S);\0A    result.normal = mul(float4(input.m_vN0.xyz, 0.0f),Debug_Model.m_vModel_Transform).xyz;\0A    result.colour = input.m_vCL;\0A\0A    return result;\0A}\0A"}
