#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyz         1     NONE   float       
; POSITION                 1   xyz         2     NONE   float       
; NORMAL                   0   xyz         3     NONE   float   xyz 
; COLOR                    0   xyzw        4     NONE   float   xyzw
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: 9a8c193e49b78e36077d5a19049d84ce.pdb
; shader hash: 9a8c193e49b78e36077d5a19049d84ce
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 5
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 5
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !57)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_PNC.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !36, !52, !55, !56}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_PNC", file: !21, line: 125, size: 544, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33, !34, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 127, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 128, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 129, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !21, line: 130, baseType: !25, size: 96, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 131, baseType: !4, size: 128, align: 32, offset: 416)
!36 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !37, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!25, !25, !39}
!39 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !40, line: 21, size: 256, align: 32, elements: !41)
!40 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!41 = !{!42, !43, !44, !45, !48, !49, !50, !51}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !39, file: !40, line: 23, baseType: !8, size: 32, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !39, file: !40, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !39, file: !40, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !39, file: !40, line: 26, baseType: !46, size: 32, align: 32, offset: 96)
!46 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !47)
!47 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !39, file: !40, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !39, file: !40, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !39, file: !40, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !39, file: !40, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!52 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !53, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!53 = !DISubroutineType(types: !54)
!54 = !{!25, !25}
!55 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !53, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !53, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!57 = !{!58, !65, !68, !73, !75, !115, !129, !153, !163, !172, !190, !192}
!58 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !59, isLocal: false, isDefinition: true)
!59 = !DICompositeType(tag: DW_TAG_array_type, baseType: !60, size: 512, align: 32, elements: !63)
!60 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !61)
!61 = !{!62}
!62 = !DITemplateTypeParameter(name: "element", type: !5)
!63 = !{!64}
!64 = !DISubrange(count: 4)
!65 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !66, isLocal: false, isDefinition: true)
!66 = !DICompositeType(tag: DW_TAG_array_type, baseType: !67, size: 640, align: 32, elements: !63)
!67 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !61)
!68 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 5120, align: 32, elements: !71)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !61)
!71 = !{!72}
!72 = !DISubrange(count: 32)
!73 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!75 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !76, isLocal: false, isDefinition: true)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !77)
!77 = !{!78}
!78 = !DITemplateTypeParameter(name: "T", type: !79)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !40, line: 71, size: 42624, align: 32, elements: !80)
!80 = !{!81, !82, !105, !106, !107, !108, !109, !113}
!81 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !79, file: !40, line: 73, baseType: !39, size: 256, align: 32)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !79, file: !40, line: 74, baseType: !83, size: 512, align: 32, offset: 256)
!83 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !84)
!84 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !85, templateParams: !102)
!85 = !{!86, !87, !88, !89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !84, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!102 = !{!13, !103, !104}
!103 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!104 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !79, file: !40, line: 74, baseType: !83, size: 512, align: 32, offset: 768)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !79, file: !40, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !79, file: !40, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !79, file: !40, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !79, file: !40, line: 78, baseType: !110, size: 32768, align: 32, offset: 1664)
!110 = !DICompositeType(tag: DW_TAG_array_type, baseType: !83, size: 32768, align: 32, elements: !111)
!111 = !{!112}
!112 = !DISubrange(count: 64)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !79, file: !40, line: 79, baseType: !114, size: 8192, align: 32, offset: 34432)
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !111)
!115 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !116, isLocal: false, isDefinition: true)
!116 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !117)
!117 = !{!118}
!118 = !DITemplateTypeParameter(name: "T", type: !119)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !40, line: 60, size: 2304, align: 32, elements: !120)
!120 = !{!121, !122, !123, !124, !125, !126, !127, !128}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !119, file: !40, line: 62, baseType: !39, size: 256, align: 32)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !119, file: !40, line: 63, baseType: !83, size: 512, align: 32, offset: 256)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !119, file: !40, line: 63, baseType: !83, size: 512, align: 32, offset: 768)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !119, file: !40, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !119, file: !40, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !119, file: !40, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !119, file: !40, line: 67, baseType: !83, size: 512, align: 32, offset: 1664)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !119, file: !40, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!129 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !130, isLocal: false, isDefinition: true)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !131)
!131 = !{!132}
!132 = !DITemplateTypeParameter(name: "T", type: !133)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !40, line: 48, size: 17152, align: 32, elements: !134)
!134 = !{!135, !136, !137, !138, !146, !147, !148, !149}
!135 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !133, file: !40, line: 50, baseType: !39, size: 256, align: 32)
!136 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !133, file: !40, line: 51, baseType: !46, size: 32, align: 32, offset: 256)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !133, file: !40, line: 52, baseType: !46, size: 32, align: 32, offset: 288)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !133, file: !40, line: 53, baseType: !139, size: 64, align: 32, offset: 320)
!139 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !140)
!140 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !141, templateParams: !144)
!141 = !{!142, !143}
!142 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !140, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !140, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!144 = !{!13, !145}
!145 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !133, file: !40, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !133, file: !40, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !133, file: !40, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !133, file: !40, line: 57, baseType: !150, size: 16384, align: 32, offset: 768)
!150 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !151)
!151 = !{!152}
!152 = !DISubrange(count: 128)
!153 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !154, isLocal: false, isDefinition: true)
!154 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !155)
!155 = !{!156}
!156 = !DITemplateTypeParameter(name: "T", type: !157)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !40, line: 40, size: 544, align: 32, elements: !158)
!158 = !{!159, !160, !161, !162}
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !157, file: !40, line: 42, baseType: !39, size: 256, align: 32)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !157, file: !40, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !157, file: !40, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!162 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !157, file: !40, line: 45, baseType: !46, size: 32, align: 32, offset: 512)
!163 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !164, isLocal: false, isDefinition: true)
!164 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !165)
!165 = !{!166}
!166 = !DITemplateTypeParameter(name: "T", type: !167)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !40, line: 34, size: 1280, align: 32, elements: !168)
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !167, file: !40, line: 36, baseType: !39, size: 256, align: 32)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !167, file: !40, line: 37, baseType: !83, size: 512, align: 32, offset: 256)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !167, file: !40, line: 37, baseType: !83, size: 512, align: 32, offset: 768)
!172 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !173, isLocal: false, isDefinition: true)
!173 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !174)
!174 = !{!175}
!175 = !DITemplateTypeParameter(name: "T", type: !176)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !177)
!177 = !{!178, !179, !180, !181, !189}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !176, file: !21, line: 162, baseType: !83, size: 512, align: 32)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !176, file: !21, line: 162, baseType: !83, size: 512, align: 32, offset: 512)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !176, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !176, file: !21, line: 164, baseType: !182, size: 2048, align: 32, offset: 1152)
!182 = !DICompositeType(tag: DW_TAG_array_type, baseType: !183, size: 2048, align: 32, elements: !187)
!183 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !184)
!184 = !{!185, !186}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !183, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !183, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!187 = !{!188}
!188 = !DISubrange(count: 8)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !176, file: !21, line: 165, baseType: !46, size: 32, align: 32, offset: 3200)
!190 = !DIGlobalVariable(name: "st2084_max_nits", scope: !36, file: !21, line: 228, type: !191, isLocal: true, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!192 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !52, file: !21, line: 180, type: !193, isLocal: false, isDefinition: true)
!193 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !194)
!194 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !195)
!195 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !196, templateParams: !206)
!196 = !{!197, !198, !199, !200, !201, !202, !203, !204, !205}
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !195, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!206 = !{!13, !207, !208}
!207 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!208 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!209 = !{i32 2, !"Dwarf Version", i32 4}
!210 = !{i32 2, !"Debug Info Version", i32 3}
!211 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!212 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_PNC.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_PNC input) : SV_TARGET\0A{\0A    float3 colour = input.colour.rgb * Debug_Model.m_vLight_Ambient.rgb;\0A    colour += clamp( dot( Debug_Model.m_vLight_Direction.xyz, normalize( input.normal.xyz ) ), 0.0F, 1.0F) * input.colour.rgb * Debug_Model.m_vLight_Direction_Colour.rgb;\0A    colour = HDRCorrection( colour.rgb, Debug_Model.m_sDESC );\0A    return float4( colour, input.colour.a );\0A}"}
