#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; POSITION                 0   xyz         1     NONE   float       
; POSITION                 1   xyz         2     NONE   float   xyz 
; NORMAL                   0   xyz         3     NONE   float   xyz 
; COLOR                    0   xyzw        4     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: c92f26105ab2895f0a17e9cecccd8915.pdb
; shader hash: c92f26105ab2895f0a17e9cecccd8915
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 5
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 5
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !60)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Test_PNC.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !36, !39, !55, !58, !59}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_PNC", file: !21, line: 125, size: 544, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !33, !34, !35}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_p", scope: !20, file: !21, line: 127, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 128, baseType: !25, size: 96, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !27, templateParams: !31)
!27 = !{!28, !29, !30}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!31 = !{!13, !32}
!32 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "pos_w", scope: !20, file: !21, line: 129, baseType: !25, size: 96, align: 32, offset: 224)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "normal", scope: !20, file: !21, line: 130, baseType: !25, size: 96, align: 32, offset: 320)
!35 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 131, baseType: !4, size: 128, align: 32, offset: 416)
!36 = !DISubprogram(name: "Apply_Lighting_Unit_Test", linkageName: "\01?Apply_Lighting_Unit_Test@@YA?AV?$vector@M$02@@V1@00@Z", scope: !21, file: !21, line: 251, type: !37, isLocal: false, isDefinition: true, scopeLine: 252, flags: DIFlagPrototyped, isOptimized: false)
!37 = !DISubroutineType(types: !38)
!38 = !{!25, !25, !25, !25}
!39 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !40, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!40 = !DISubroutineType(types: !41)
!41 = !{!25, !25, !42}
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !43, line: 21, size: 256, align: 32, elements: !44)
!43 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!44 = !{!45, !46, !47, !48, !51, !52, !53, !54}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !42, file: !43, line: 23, baseType: !8, size: 32, align: 32)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !42, file: !43, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !42, file: !43, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !42, file: !43, line: 26, baseType: !49, size: 32, align: 32, offset: 96)
!49 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !50)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !42, file: !43, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !42, file: !43, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !42, file: !43, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !42, file: !43, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!55 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !56, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!56 = !DISubroutineType(types: !57)
!57 = !{!25, !25}
!58 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !56, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !56, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!60 = !{!61, !68, !71, !76, !78, !118, !132, !156, !166, !175, !193, !195}
!61 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !62, isLocal: false, isDefinition: true)
!62 = !DICompositeType(tag: DW_TAG_array_type, baseType: !63, size: 512, align: 32, elements: !66)
!63 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !64)
!64 = !{!65}
!65 = !DITemplateTypeParameter(name: "element", type: !5)
!66 = !{!67}
!67 = !DISubrange(count: 4)
!68 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !69, isLocal: false, isDefinition: true)
!69 = !DICompositeType(tag: DW_TAG_array_type, baseType: !70, size: 640, align: 32, elements: !66)
!70 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !64)
!71 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !72, isLocal: false, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_array_type, baseType: !73, size: 5120, align: 32, elements: !74)
!73 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !64)
!74 = !{!75}
!75 = !DISubrange(count: 32)
!76 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!78 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !80)
!80 = !{!81}
!81 = !DITemplateTypeParameter(name: "T", type: !82)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !43, line: 71, size: 42624, align: 32, elements: !83)
!83 = !{!84, !85, !108, !109, !110, !111, !112, !116}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !82, file: !43, line: 73, baseType: !42, size: 256, align: 32)
!85 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !82, file: !43, line: 74, baseType: !86, size: 512, align: 32, offset: 256)
!86 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !87)
!87 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !88, templateParams: !105)
!88 = !{!89, !90, !91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !87, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!105 = !{!13, !106, !107}
!106 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!107 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !82, file: !43, line: 74, baseType: !86, size: 512, align: 32, offset: 768)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !82, file: !43, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !82, file: !43, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !82, file: !43, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !82, file: !43, line: 78, baseType: !113, size: 32768, align: 32, offset: 1664)
!113 = !DICompositeType(tag: DW_TAG_array_type, baseType: !86, size: 32768, align: 32, elements: !114)
!114 = !{!115}
!115 = !DISubrange(count: 64)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !82, file: !43, line: 79, baseType: !117, size: 8192, align: 32, offset: 34432)
!117 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !114)
!118 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !119, isLocal: false, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !120)
!120 = !{!121}
!121 = !DITemplateTypeParameter(name: "T", type: !122)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !43, line: 60, size: 2304, align: 32, elements: !123)
!123 = !{!124, !125, !126, !127, !128, !129, !130, !131}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !122, file: !43, line: 62, baseType: !42, size: 256, align: 32)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !122, file: !43, line: 63, baseType: !86, size: 512, align: 32, offset: 256)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !122, file: !43, line: 63, baseType: !86, size: 512, align: 32, offset: 768)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !122, file: !43, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !122, file: !43, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !122, file: !43, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !122, file: !43, line: 67, baseType: !86, size: 512, align: 32, offset: 1664)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !122, file: !43, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!132 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !133, isLocal: false, isDefinition: true)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !134)
!134 = !{!135}
!135 = !DITemplateTypeParameter(name: "T", type: !136)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !43, line: 48, size: 17152, align: 32, elements: !137)
!137 = !{!138, !139, !140, !141, !149, !150, !151, !152}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !136, file: !43, line: 50, baseType: !42, size: 256, align: 32)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !136, file: !43, line: 51, baseType: !49, size: 32, align: 32, offset: 256)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !136, file: !43, line: 52, baseType: !49, size: 32, align: 32, offset: 288)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !136, file: !43, line: 53, baseType: !142, size: 64, align: 32, offset: 320)
!142 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 148, baseType: !143)
!143 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 148, size: 64, align: 32, elements: !144, templateParams: !147)
!144 = !{!145, !146}
!145 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !143, file: !1, line: 148, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !143, file: !1, line: 148, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!147 = !{!13, !148}
!148 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!149 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !136, file: !43, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!150 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !136, file: !43, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!151 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !136, file: !43, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !136, file: !43, line: 57, baseType: !153, size: 16384, align: 32, offset: 768)
!153 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !154)
!154 = !{!155}
!155 = !DISubrange(count: 128)
!156 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !157, isLocal: false, isDefinition: true)
!157 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !158)
!158 = !{!159}
!159 = !DITemplateTypeParameter(name: "T", type: !160)
!160 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !43, line: 40, size: 544, align: 32, elements: !161)
!161 = !{!162, !163, !164, !165}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !160, file: !43, line: 42, baseType: !42, size: 256, align: 32)
!163 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !160, file: !43, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!164 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !160, file: !43, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!165 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !160, file: !43, line: 45, baseType: !49, size: 32, align: 32, offset: 512)
!166 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !167, isLocal: false, isDefinition: true)
!167 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !168)
!168 = !{!169}
!169 = !DITemplateTypeParameter(name: "T", type: !170)
!170 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !43, line: 34, size: 1280, align: 32, elements: !171)
!171 = !{!172, !173, !174}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !170, file: !43, line: 36, baseType: !42, size: 256, align: 32)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !170, file: !43, line: 37, baseType: !86, size: 512, align: 32, offset: 256)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !170, file: !43, line: 37, baseType: !86, size: 512, align: 32, offset: 768)
!175 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !176, isLocal: false, isDefinition: true)
!176 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !177)
!177 = !{!178}
!178 = !DITemplateTypeParameter(name: "T", type: !179)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !180)
!180 = !{!181, !182, !183, !184, !192}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !179, file: !21, line: 162, baseType: !86, size: 512, align: 32)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !179, file: !21, line: 162, baseType: !86, size: 512, align: 32, offset: 512)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !179, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !179, file: !21, line: 164, baseType: !185, size: 2048, align: 32, offset: 1152)
!185 = !DICompositeType(tag: DW_TAG_array_type, baseType: !186, size: 2048, align: 32, elements: !190)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !187)
!187 = !{!188, !189}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !186, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!189 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !186, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!190 = !{!191}
!191 = !DISubrange(count: 8)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !179, file: !21, line: 165, baseType: !49, size: 32, align: 32, offset: 3200)
!193 = !DIGlobalVariable(name: "st2084_max_nits", scope: !39, file: !21, line: 228, type: !194, isLocal: true, isDefinition: true)
!194 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!195 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !55, file: !21, line: 180, type: !196, isLocal: false, isDefinition: true)
!196 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !197)
!197 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !198)
!198 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !199, templateParams: !209)
!199 = !{!200, !201, !202, !203, !204, !205, !206, !207, !208}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!204 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!208 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !198, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!209 = !{!13, !210, !211}
!210 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!211 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!212 = !{i32 2, !"Dwarf Version", i32 4}
!213 = !{i32 2, !"Debug Info Version", i32 3}
!214 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!215 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Test_PNC.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_PNC input) : SV_TARGET\0A{\0A    float3 colour = Apply_Lighting_Unit_Test( input.pos_w, input.normal, input.colour.rgb );\0A    colour = HDRCorrection( colour, Debug_Model.m_sDESC );\0A    return float4( colour, 1.0f );\0A}"}
