#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float       
; TEXCOORD                 0   xy          1     NONE   float       
; COLOR                    0   xyzw        2     NONE   float   xyz 
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: dc5237618d1bc7cf8c7bc297a14c99d5.pdb
; shader hash: dc5237618d1bc7cf8c7bc297a14c99d5
;
; Pipeline Runtime Information: 
;
;PSVRuntimeInfo:
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
; MinimumExpectedWaveLaneCount: 0
; MaximumExpectedWaveLaneCount: 4294967295
; UsesViewID: false
; SigInputElements: 3
; SigOutputElements: 1
; SigPatchConstOrPrimElements: 0
; SigInputVectors: 3
; SigOutputVectors[0]: 1
; SigOutputVectors[1]: 0
; SigOutputVectors[2]: 0
; SigOutputVectors[3]: 0
; EntryFunctionName: main
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; TEXCOORD                 0                 linear       
; COLOR                    0                 linear       
;
; Output signature:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc(private) 1.8.0.4739 (d9a5e97d0)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16, globals: !62)
!1 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_UIG.ps.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17, !33, !57, !60, !61}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 3, type: !18, isLocal: false, isDefinition: true, scopeLine: 4, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!4, !20}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PSInput_UI", file: !21, line: 97, size: 320, align: 32, elements: !22)
!21 = !DIFile(filename: "E:/GitHub/teikitu-rti/teikitu_release/teikitu_private/src/TgS KERNEL/Standard_Debug_Common.hlsli", directory: "")
!22 = !{!23, !24, !32}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "pos_v", scope: !20, file: !21, line: 99, baseType: !4, size: 128, align: 32)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !21, line: 100, baseType: !25, size: 64, align: 32, offset: 128)
!25 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !26)
!26 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !27, templateParams: !30)
!27 = !{!28, !29}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !26, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !26, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !20, file: !21, line: 101, baseType: !4, size: 128, align: 32, offset: 192)
!33 = !DISubprogram(name: "HDRCorrection", linkageName: "\01?HDRCorrection@@YA?AV?$vector@M$02@@V1@USTg2_KN_GPU_HLSL_Output_DESC@@@Z", scope: !21, file: !21, line: 220, type: !34, isLocal: false, isDefinition: true, scopeLine: 221, flags: DIFlagPrototyped, isOptimized: false)
!34 = !DISubroutineType(types: !35)
!35 = !{!36, !36, !44}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 5, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 5, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 5, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 5, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!13, !43}
!43 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_Output_DESC", file: !45, line: 21, size: 256, align: 32, elements: !46)
!45 = !DIFile(filename: "E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_sdk\5CTgS KERNEL\5CTgS Kernel [GPU] - Resource [HLSL] [Data].h", directory: "")
!46 = !{!47, !48, !49, !50, !53, !54, !55, !56}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPerceptual_Exponent", scope: !44, file: !45, line: 23, baseType: !8, size: 32, align: 32)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "m_fSDR_In_HDR_Nits_Level", scope: !44, file: !45, line: 24, baseType: !8, size: 32, align: 32, offset: 32)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "m_enColour_Space", scope: !44, file: !45, line: 25, baseType: !15, size: 32, align: 32, offset: 64)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "m_bHDR_Enabled", scope: !44, file: !45, line: 26, baseType: !51, size: 32, align: 32, offset: 96)
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 146, baseType: !52)
!52 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!53 = !DIDerivedType(tag: DW_TAG_member, name: "m_fPad", scope: !44, file: !45, line: 28, baseType: !8, size: 32, align: 32, offset: 128)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMin_Luminance", scope: !44, file: !45, line: 29, baseType: !8, size: 32, align: 32, offset: 160)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Luminance", scope: !44, file: !45, line: 30, baseType: !8, size: 32, align: 32, offset: 192)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "m_fMax_Full_Frame_Luminance", scope: !44, file: !45, line: 31, baseType: !8, size: 32, align: 32, offset: 224)
!57 = !DISubprogram(name: "Rec709ToRec2020", linkageName: "\01?Rec709ToRec2020@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 178, type: !58, isLocal: false, isDefinition: true, scopeLine: 179, flags: DIFlagPrototyped, isOptimized: false)
!58 = !DISubroutineType(types: !59)
!59 = !{!36, !36}
!60 = !DISubprogram(name: "LinearToST2084", linkageName: "\01?LinearToST2084@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 189, type: !58, isLocal: false, isDefinition: true, scopeLine: 190, flags: DIFlagPrototyped, isOptimized: false)
!61 = !DISubprogram(name: "LinearToSRGB", linkageName: "\01?LinearToSRGB@@YA?AV?$vector@M$02@@V1@@Z", scope: !21, file: !21, line: 173, type: !58, isLocal: false, isDefinition: true, scopeLine: 174, flags: DIFlagPrototyped, isOptimized: false)
!62 = !{!63, !70, !73, !78, !80, !120, !134, !151, !161, !170, !188, !190}
!63 = !DIGlobalVariable(name: "g_default_texture_cube", linkageName: "\01?g_default_texture_cube@@3PAV?$TextureCube@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 87, type: !64, isLocal: false, isDefinition: true)
!64 = !DICompositeType(tag: DW_TAG_array_type, baseType: !65, size: 512, align: 32, elements: !68)
!65 = !DICompositeType(tag: DW_TAG_class_type, name: "TextureCube<vector<float, 4> >", file: !1, line: 87, size: 128, align: 32, elements: !2, templateParams: !66)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "element", type: !5)
!68 = !{!69}
!69 = !DISubrange(count: 4)
!70 = !DIGlobalVariable(name: "g_default_texture_volume", linkageName: "\01?g_default_texture_volume@@3PAV?$Texture3D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 88, type: !71, isLocal: false, isDefinition: true)
!71 = !DICompositeType(tag: DW_TAG_array_type, baseType: !72, size: 640, align: 32, elements: !68)
!72 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture3D<vector<float, 4> >", file: !1, line: 88, size: 160, align: 32, elements: !2, templateParams: !66)
!73 = !DIGlobalVariable(name: "g_default_texture_image", linkageName: "\01?g_default_texture_image@@3PAV?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !21, line: 89, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_array_type, baseType: !75, size: 5120, align: 32, elements: !76)
!75 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 89, size: 160, align: 32, elements: !2, templateParams: !66)
!76 = !{!77}
!77 = !DISubrange(count: 32)
!78 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !21, line: 90, type: !79, isLocal: false, isDefinition: true)
!79 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 90, size: 32, align: 32, elements: !2)
!80 = !DIGlobalVariable(name: "Debug_Model_Instance", linkageName: "\01?Debug_Model_Instance@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model_Instance@@@@A", scope: !0, file: !21, line: 146, type: !81, isLocal: false, isDefinition: true)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model_Instance>", file: !1, line: 146, size: 32, align: 32, elements: !2, templateParams: !82)
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model_Instance", file: !45, line: 71, size: 42624, align: 32, elements: !85)
!85 = !{!86, !87, !110, !111, !112, !113, !114, !118}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !84, file: !45, line: 73, baseType: !44, size: 256, align: 32)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !84, file: !45, line: 74, baseType: !88, size: 512, align: 32, offset: 256)
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4x4", file: !1, line: 146, baseType: !89)
!89 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 4, 4>", file: !1, line: 146, size: 512, align: 32, elements: !90, templateParams: !107)
!90 = !{!91, !92, !93, !94, !95, !96, !97, !98, !99, !100, !101, !102, !103, !104, !105, !106}
!91 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!93 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "_14", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!95 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, name: "_24", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "_34", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_41", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!104 = !DIDerivedType(tag: DW_TAG_member, name: "_42", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 416, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "_43", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "_44", scope: !89, file: !1, line: 146, baseType: !8, size: 32, align: 32, offset: 480, flags: DIFlagPublic)
!107 = !{!13, !108, !109}
!108 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 4)
!109 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 4)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !84, file: !45, line: 74, baseType: !88, size: 512, align: 32, offset: 768)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !84, file: !45, line: 75, baseType: !4, size: 128, align: 32, offset: 1280)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !84, file: !45, line: 76, baseType: !4, size: 128, align: 32, offset: 1408)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !84, file: !45, line: 77, baseType: !4, size: 128, align: 32, offset: 1536)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Transform", scope: !84, file: !45, line: 78, baseType: !115, size: 32768, align: 32, offset: 1664)
!115 = !DICompositeType(tag: DW_TAG_array_type, baseType: !88, size: 32768, align: 32, elements: !116)
!116 = !{!117}
!117 = !DISubrange(count: 64)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "m_avModel_Colour", scope: !84, file: !45, line: 79, baseType: !119, size: 8192, align: 32, offset: 34432)
!119 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 8192, align: 32, elements: !116)
!120 = !DIGlobalVariable(name: "Debug_Model", linkageName: "\01?Debug_Model@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Model@@@@A", scope: !0, file: !21, line: 147, type: !121, isLocal: false, isDefinition: true)
!121 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Model>", file: !1, line: 147, size: 32, align: 32, elements: !2, templateParams: !122)
!122 = !{!123}
!123 = !DITemplateTypeParameter(name: "T", type: !124)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Model", file: !45, line: 60, size: 2304, align: 32, elements: !125)
!125 = !{!126, !127, !128, !129, !130, !131, !132, !133}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !124, file: !45, line: 62, baseType: !44, size: 256, align: 32)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !124, file: !45, line: 63, baseType: !88, size: 512, align: 32, offset: 256)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !124, file: !45, line: 63, baseType: !88, size: 512, align: 32, offset: 768)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction_Colour", scope: !124, file: !45, line: 64, baseType: !4, size: 128, align: 32, offset: 1280)
!130 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Direction", scope: !124, file: !45, line: 65, baseType: !4, size: 128, align: 32, offset: 1408)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "m_vLight_Ambient", scope: !124, file: !45, line: 66, baseType: !4, size: 128, align: 32, offset: 1536)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "m_vModel_Transform", scope: !124, file: !45, line: 67, baseType: !88, size: 512, align: 32, offset: 1664)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "m_uModel_Colour", scope: !124, file: !45, line: 68, baseType: !4, size: 128, align: 32, offset: 2176)
!134 = !DIGlobalVariable(name: "Debug_Text", linkageName: "\01?Debug_Text@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Text@@@@A", scope: !0, file: !21, line: 148, type: !135, isLocal: false, isDefinition: true)
!135 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Text>", file: !1, line: 148, size: 32, align: 32, elements: !2, templateParams: !136)
!136 = !{!137}
!137 = !DITemplateTypeParameter(name: "T", type: !138)
!138 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Text", file: !45, line: 48, size: 17152, align: 32, elements: !139)
!139 = !{!140, !141, !142, !143, !144, !145, !146, !147}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !138, file: !45, line: 50, baseType: !44, size: 256, align: 32)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !138, file: !45, line: 51, baseType: !51, size: 32, align: 32, offset: 256)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiPad", scope: !138, file: !45, line: 52, baseType: !51, size: 32, align: 32, offset: 288)
!143 = !DIDerivedType(tag: DW_TAG_member, name: "m_vStart_Position_V", scope: !138, file: !45, line: 53, baseType: !25, size: 64, align: 32, offset: 320)
!144 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_S", scope: !138, file: !45, line: 54, baseType: !4, size: 128, align: 32, offset: 384)
!145 = !DIDerivedType(tag: DW_TAG_member, name: "m_vFont_Glyph_Scale_UV", scope: !138, file: !45, line: 55, baseType: !4, size: 128, align: 32, offset: 512)
!146 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Colour", scope: !138, file: !45, line: 56, baseType: !4, size: 128, align: 32, offset: 640)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "m_vText_Offset", scope: !138, file: !45, line: 57, baseType: !148, size: 16384, align: 32, offset: 768)
!148 = !DICompositeType(tag: DW_TAG_array_type, baseType: !4, size: 16384, align: 32, elements: !149)
!149 = !{!150}
!150 = !DISubrange(count: 128)
!151 = !DIGlobalVariable(name: "Debug_UI", linkageName: "\01?Debug_UI@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_UI@@@@A", scope: !0, file: !21, line: 149, type: !152, isLocal: false, isDefinition: true)
!152 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_UI>", file: !1, line: 149, size: 32, align: 32, elements: !2, templateParams: !153)
!153 = !{!154}
!154 = !DITemplateTypeParameter(name: "T", type: !155)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_UI", file: !45, line: 40, size: 544, align: 32, elements: !156)
!156 = !{!157, !158, !159, !160}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !155, file: !45, line: 42, baseType: !44, size: 256, align: 32)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "m_vRect_UI", scope: !155, file: !45, line: 43, baseType: !4, size: 128, align: 32, offset: 256)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "m_vUI_Colour", scope: !155, file: !45, line: 44, baseType: !4, size: 128, align: 32, offset: 384)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "m_uiSelect_Default_Texture_Index", scope: !155, file: !45, line: 45, baseType: !51, size: 32, align: 32, offset: 512)
!161 = !DIGlobalVariable(name: "Debug_Line", linkageName: "\01?Debug_Line@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Debug_Line@@@@A", scope: !0, file: !21, line: 150, type: !162, isLocal: false, isDefinition: true)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Debug_Line>", file: !1, line: 150, size: 32, align: 32, elements: !2, templateParams: !163)
!163 = !{!164}
!164 = !DITemplateTypeParameter(name: "T", type: !165)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Debug_Line", file: !45, line: 34, size: 1280, align: 32, elements: !166)
!166 = !{!167, !168, !169}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "m_sDESC", scope: !165, file: !45, line: 36, baseType: !44, size: 256, align: 32)
!168 = !DIDerivedType(tag: DW_TAG_member, name: "m_mW2C", scope: !165, file: !45, line: 37, baseType: !88, size: 512, align: 32, offset: 256)
!169 = !DIDerivedType(tag: DW_TAG_member, name: "m_mC2S", scope: !165, file: !45, line: 37, baseType: !88, size: 512, align: 32, offset: 768)
!170 = !DIGlobalVariable(name: "Unit_Test_Scene", linkageName: "\01?Unit_Test_Scene@@3U?$ConstantBuffer@USTg2_KN_GPU_HLSL_CB_Unit_Test_Scene@@@@A", scope: !0, file: !21, line: 167, type: !171, isLocal: false, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConstantBuffer<STg2_KN_GPU_HLSL_CB_Unit_Test_Scene>", file: !1, line: 167, size: 32, align: 32, elements: !2, templateParams: !172)
!172 = !{!173}
!173 = !DITemplateTypeParameter(name: "T", type: !174)
!174 = !DICompositeType(tag: DW_TAG_structure_type, name: "STg2_KN_GPU_HLSL_CB_Unit_Test_Scene", file: !21, line: 160, size: 3232, align: 32, elements: !175)
!175 = !{!176, !177, !178, !179, !187}
!176 = !DIDerivedType(tag: DW_TAG_member, name: "view", scope: !174, file: !21, line: 162, baseType: !88, size: 512, align: 32)
!177 = !DIDerivedType(tag: DW_TAG_member, name: "projection", scope: !174, file: !21, line: 162, baseType: !88, size: 512, align: 32, offset: 512)
!178 = !DIDerivedType(tag: DW_TAG_member, name: "scene_light_ambient", scope: !174, file: !21, line: 163, baseType: !4, size: 128, align: 32, offset: 1024)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "scene_lights", scope: !174, file: !21, line: 164, baseType: !180, size: 2048, align: 32, offset: 1152)
!180 = !DICompositeType(tag: DW_TAG_array_type, baseType: !181, size: 2048, align: 32, elements: !185)
!181 = !DICompositeType(tag: DW_TAG_structure_type, name: "Light_Data", file: !21, line: 153, size: 256, align: 32, elements: !182)
!182 = !{!183, !184}
!183 = !DIDerivedType(tag: DW_TAG_member, name: "origin_and_range", scope: !181, file: !21, line: 155, baseType: !4, size: 128, align: 32)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "colour", scope: !181, file: !21, line: 156, baseType: !4, size: 128, align: 32, offset: 128)
!185 = !{!186}
!186 = !DISubrange(count: 8)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "scene_num_lights", scope: !174, file: !21, line: 165, baseType: !51, size: 32, align: 32, offset: 3200)
!188 = !DIGlobalVariable(name: "st2084_max_nits", scope: !33, file: !21, line: 228, type: !189, isLocal: true, isDefinition: true)
!189 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!190 = !DIGlobalVariable(name: "conversion", linkageName: "\01?conversion@?1??Rec709ToRec2020@@YA?AV?$vector@M$02@@V2@@Z@4V?$matrix@M$02$02@@B.v.v", scope: !57, file: !21, line: 180, type: !191, isLocal: false, isDefinition: true)
!191 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !192)
!192 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3x3", file: !1, line: 180, baseType: !193)
!193 = !DICompositeType(tag: DW_TAG_class_type, name: "matrix<float, 3, 3>", file: !1, line: 180, size: 288, align: 32, elements: !194, templateParams: !204)
!194 = !{!195, !196, !197, !198, !199, !200, !201, !202, !203}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "_11", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "_12", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!197 = !DIDerivedType(tag: DW_TAG_member, name: "_13", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "_21", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "_22", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "_23", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "_31", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!202 = !DIDerivedType(tag: DW_TAG_member, name: "_32", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!203 = !DIDerivedType(tag: DW_TAG_member, name: "_33", scope: !193, file: !1, line: 180, baseType: !8, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!204 = !{!13, !205, !206}
!205 = !DITemplateValueParameter(name: "row_count", type: !15, value: i32 3)
!206 = !DITemplateValueParameter(name: "col_count", type: !15, value: i32 3)
!207 = !{i32 2, !"Dwarf Version", i32 4}
!208 = !{i32 2, !"Debug Info Version", i32 3}
!209 = !{!"dxc(private) 1.8.0.4739 (d9a5e97d0)"}
!210 = !{!"E:\5CGitHub\5Cteikitu-rti\5Cteikitu_release\5Cteikitu_private\5Csrc\5CTgS KERNEL\5CStandard_Debug_UIG.ps.hlsl", !"#include \22Standard_Debug_Common.hlsli\22\0A\0Afloat4 main(in PSInput_UI input) : SV_TARGET\0A{\0A    float3 colour = pow(abs(input.colour.rgb * Debug_UI.m_vUI_Colour.rgb), Debug_UI.m_sDESC.m_fPerceptual_Exponent);\0A    colour = HDRCorrection( colour, Debug_UI.m_sDESC );\0A    return float4( colour, 1.0F );\0A}"}
